{
    "classes": {
        "BindableFunction": {
            "summary": "Allow functions defined in one script to be called by another script",
            "members": {
                "Invoke": {
                    "summary": "Causes the function assigned to OnInvoke to be called. Arguments passed to this function get passed to OnInvoke function."
                },
                "OnInvoke": {
                    "summary": "Should be defined as a function. This function is called when Invoke() is called. Number of arguments is variable."
                }
            }
        },
        "BindableEvent": {
            "summary": "Allow events defined in one script to be subscribed to by another script",
            "members": {
                "Fire": {
                    "summary": "Used to make the custom event fire (see Event for more info). Arguments can be variable length."
                },
                "Event": {
                    "summary": "This event fires when the Fire() method is used.  Receives the variable length arguments from Fire()."
                }
            }
        },
        "TouchTransmitter": {
            "summary": "Used by networking and replication code to transmit touch events - no other purpose"
        },
        "ForceField": {
            "summary": "Prevents joint breakage from explosions, and stops Humanoids from taking damage"
        },
        "TeleportService": {
            "summary": "Allows players to seamlessly leave a game and join another",
            "members": {
                "CustomizedTeleportUI": {
                    "summary": "Deprecated"
                }
            }
        },
        "CollectionService": {
            "summary": "A service which provides collections of instances based on tags assigned to them.",
            "members": {
                "ItemAdded": {
                    "summary": "Deprecated. Use GetInstanceAddedSignal instead."
                },
                "ItemRemoved": {
                    "summary": "Deprecated. Use GetInstancedRemovedSignal instead."
                },
                "GetCollection": {
                    "summary": "Deprecated. Use GetTagged instead."
                },
                "GetTagged": {
                    "summary": "Returns an array of all of the instances in the data model which have the given tag."
                },
                "AddTag": {
                    "summary": "Adds a tag to an instance."
                },
                "RemoveTag": {
                    "summary": "Removes a tag to an instance."
                },
                "GetTags": {
                    "summary": "Returns a list of all the collections that an instance belongs to."
                },
                "HasTag": {
                    "summary": "Returns whether the given instance has the given tag."
                },
                "GetInstanceAddedSignal": {
                    "summary": "Returns a signal that fires when the given tag either has a new instance with that tag added to the data model or that tag is assigned to an instance within the data model."
                },
                "GetInstanceRemovedSignal": {
                    "summary": "Returns a signal that fires when the given tag either has an instance with that tag removed from the data model or that tag is removed from an instance within the data model."
                }
            }
        },
        "AssetService": {
            "summary": "A service used to set and get information about assets stored on the Roblox website.",
            "members": {
                "RevertAsset": {
                    "summary": "Reverts a given place id to the version number provided. Returns true if successful on reverting, false otherwise."
                },
                "SetPlacePermissions": {
                    "summary": "Sets the permissions for a placeID to the place accessType. An optional table (inviteList) can be included that will set the accessType for only the player names provided. The table should be set up as an array of usernames (strings)."
                },
                "GetPlacePermissions": {
                    "summary": "Given a placeID, this function will return a table with the permissions of the place. Useful for determining what kind of permissions a particular user may have for a place."
                },
                "GetAssetVersions": {
                    "summary": "Given a placeID, this function will return a table with the version info of the place. An optional arg of page number can be used to page through all revisions (a single page may hold about 50 revisions)."
                },
                "GetCreatorAssetID": {
                    "summary": "Given a creationID, this function will return the asset that created the creationID. If no other asset created the given creationID, 0 is returned."
                }
            }
        },
        "HttpService": {
            "members": {
                "HttpEnabled": {
                    "summary": "Enabling http requests from scripts"
                }
            }
        },
        "AnalyticsService": {
            "members": {
                "ApiKey": {
                    "summary": "Set ApiKey"
                }
            }
        },
        "InsertService": {
            "summary": "A service used to insert objects stored on the website into the game.",
            "members": {
                "AllowClientInsertModels": {
                    "summary": "Can be set in non-filtering-enabled places to allow LoadAsset to be used in LocalScripts."
                },
                "AllowInsertFreeModels": {
                    "summary": "Allows free models to be inserted into place."
                },
                "GetCollection": {
                    "summary": "Returns a table for the assets stored in the category.  A category is an setId from www.roblox.com that links to a set.  <a href='http://wiki.roblox.com/index.php?title=API:Class/InsertService/GetCollection' target='_blank'>More info on table format</a>. <a href='http://wiki.roblox.com/index.php/Sets' target='_blank'>More info on sets</a>"
                },
                "Insert": {
                    "summary": "Inserts the Instance into the workspace.  It is recommended to use Instance.Parent = game.Workspace instead, as this can cause issues currently."
                },
                "ApproveAssetId": {
                    "summary": "Deprecated"
                },
                "ApproveAssetVersionId": {
                    "summary": "Deprecated"
                },
                "GetBaseSets": {
                    "summary": "Returns a table containing a list of the various setIds that are ROBLOX approved. <a href='http://wiki.roblox.com/index.php/Sets' target='_blank'>More info on sets</a>"
                },
                "GetUserSets": {
                    "summary": "Returns a table containing a list of the various setIds that correspond to argument 'userId'. <a href='http://wiki.roblox.com/index.php/Sets' target='_blank'>More info on sets</a>"
                },
                "GetBaseCategories": {
                    "summary": "Deprecated. Use GetBaseSets() instead."
                },
                "GetUserCategories": {
                    "summary": "Deprecated. Use GetUserSets() instead."
                },
                "LoadAsset": {
                    "summary": "Returns a Model containing the Instance that resides at AssetId on the web. This call will also yield the script until the model is returned. Script execution can still continue, however, if you use a <a href='http://wiki.roblox.com/index.php?title=Coroutine' target='_blank'>coroutine</a>."
                },
                "LoadAssetVersion": {
                    "summary": "Similar to LoadAsset, but instead an AssetVersionId is passed in, which refers to a particular version of the asset which is not neccessarily the latest version."
                }
            }
        },
        "Attachment": {
            "members": {
                "WorldRotation": {
                    "summary": "Deprecated. Use WorldOrientation instead"
                },
                "Orientation": {
                    "summary": "Euler angles applied in YXZ order"
                },
                "WorldOrientation": {
                    "summary": "Euler angles applied in YXZ order"
                },
                "Axis": {
                    "summary": "Primary axis. Corresponds to the LookVector, or the first column in the part-local Attachment CFrame rotation matrix"
                },
                "SecondaryAxis": {
                    "summary": "Secondary axis. Corresponds to the UpVector, or the second column in the part-local Attachment CFrame rotation matrix"
                },
                "WorldAxis": {
                    "summary": "Primary axis in world space. Corresponds to the LookVector, or the first column in the world space Attachment CFrame rotation matrix."
                },
                "SecondaryWorldAxis": {
                    "summary": "Secondary axis in world space. Corresponds to the UpVector, or the second column in the world space Attachment CFrame rotation matrix."
                }
            }
        },
        "Constraint": {
            "members": {
                "Enabled": {
                    "summary": "Toggles whether or not this constraint is enabled. Disabled constraints will not render in game."
                },
                "Color": {
                    "summary": "The color of the in-game visual."
                },
                "Visible": {
                    "summary": "Toggles the in-game visual associated with this constraint."
                },
                "Active": {
                    "summary": "Read-only boolean, true if the Constraint is active in world."
                }
            }
        },
        "BallSocketConstraint": {
            "members": {
                "LimitsEnabled": {
                    "summary": "Enables the angular limit between the axis of Attachment0 and the axis of Attachment1."
                },
                "UpperAngle": {
                    "summary": "Maximum angle between the two main axes. Value in [0, 180]."
                },
                "Restitution": {
                    "summary": "Restitution of the limit, or how elastic it is. Value in [0, 1]."
                },
                "TwistLimitsEnabled": {
                    "summary": "Enables the angular limits around the main axis of Attachment1."
                },
                "TwistUpperAngle": {
                    "summary": "Upper angular limit around the axis of Attachment1. Value in [-180, 180]."
                },
                "TwistLowerAngle": {
                    "summary": "Lower angular limit around the axis of Attachment1. Value in [-180, 180]."
                },
                "Radius": {
                    "summary": "Radius of the in-game visual. Value in [0, inf)."
                }
            }
        },
        "RopeConstraint": {
            "members": {
                "Length": {
                    "summary": "The length of the rope or the maximum distance between the two attachments. Value in [0, inf)."
                },
                "Restitution": {
                    "summary": "Restitution of the rope, or how elastic it is. Value in [0, 1]."
                },
                "CurrentDistance": {
                    "summary": "Current distance between the two attachments. Value in [0, inf)."
                },
                "Thickness": {
                    "summary": "The thickness of the in-game visual (diameter). Value in [0, inf)."
                }
            }
        },
        "RodConstraint": {
            "members": {
                "Length": {
                    "summary": "The length of the rod or the distance to be maintained between the two attachments. Value in [0, inf)."
                },
                "CurrentDistance": {
                    "summary": "Current distance between the two attachments. Value in [0, inf)."
                },
                "Thickness": {
                    "summary": "The thickness of the in-game visual (diameter). Value in [0, inf)."
                },
                "LimitAngle0": {
                    "summary": "The angle of the cone limit formed along attachment point 0. Value in [0, 180]."
                },
                "LimitAngle1": {
                    "summary": "The angle of the cone limit formed along attachment point 1. Value in [0, 180]."
                },
                "LimitsEnabled": {
                    "summary": "Toggles the cone limits for this constraint."
                }
            }
        },
        "SpringConstraint": {
            "members": {
                "LimitsEnabled": {
                    "summary": "Enables limits on the length of the spring."
                },
                "Stiffness": {
                    "summary": "The stiffness parameter of the spring. Force is scaled based on distance from the free length. The units of this property are force / distance. Value in [0, inf)."
                },
                "Damping": {
                    "summary": "The damping parameter of the spring. The force is scaled with respect to relative velocity. The units of this property are force / velocity. Value in [0, inf)."
                },
                "FreeLength": {
                    "summary": "The distance (in studs) between the two attachments at which the spring exerts no stiffness force. Value in [0, inf)."
                },
                "MaxForce": {
                    "summary": "The maximum force that the spring can apply. Useful to prevent instabilities. The units are mass * studs / seconds^2. Value in [0, inf)."
                },
                "MaxLength": {
                    "summary": "Maximum spring length, or the maxium distance between the two attachments. Value in [0, inf)."
                },
                "MinLength": {
                    "summary": "Minimum spring length, or the minimum distance between the two attachments. Value in [0, inf)."
                },
                "Radius": {
                    "summary": "The radius of the in-game spring coil visual. Value in [0, inf)."
                },
                "Thickness": {
                    "summary": "The thickness of the spring wire (diameter) in the in-game visual. Value in [0, inf)."
                },
                "Coils": {
                    "summary": "The number of coils in the in-game visual. Value in [0, 8]."
                },
                "CurrentLength": {
                    "summary": "Current distance between the two attachments. Value in [0, inf)."
                }
            }
        },
        "TorsionSpringConstraint": {
            "members": {
                "LimitsEnabled": {
                    "summary": "Enables limits on the angle of the spring."
                },
                "Stiffness": {
                    "summary": "The stiffness parameter of the spring. Torque is scaled based on relative angle between secondary axes. The units of this property are torque / angular distance. Value in [0, inf)."
                },
                "Damping": {
                    "summary": "The damping parameter of the spring. The force is scaled based on relative angular velocity. The units of this property are torque / angular velocity. Value in [0, inf)."
                },
                "MaxTorque": {
                    "summary": "The maximum torque that the spring can apply. Useful to prevent instabilities. The units are mass * studs^2 / second^2. Value in [0, inf)."
                },
                "MaxAngle": {
                    "summary": "Maximum angle between the attachments' secondary axes. Value in [0, pi)."
                },
                "Restitution": {
                    "summary": "Restitution of the limit. Value in [0, 1]."
                },
                "Radius": {
                    "summary": "The radius of spring coil visual. Value in [0, inf)."
                },
                "Coils": {
                    "summary": "The number of coils in the in-game visual. Value in [0, 8]."
                },
                "CurrentAngle": {
                    "summary": "Current angle between the attachments' secondary axes. Value in [0, inf)."
                }
            }
        },
        "WeldConstraint": {
            "members": {
                "Active": {
                    "summary": "Read-only boolean, true if the joint is active in world. Rigid joints may be inactive if they are redundant or form cycles."
                }
            }
        },
        "NoCollisionConstraint": {
            "members": {
                "Enabled": {
                    "summary": "If true Part0 and Part1 will not collide, if false the parts will collide."
                }
            }
        },
        "HingeConstraint": {
            "members": {
                "ActuatorType": {
                    "summary": "Type of the rotational actuator: None, Motor, or Servo. "
                },
                "LimitsEnabled": {
                    "summary": "Enables the angular limits on rotations around the main axis of Attachment0."
                },
                "UpperAngle": {
                    "summary": "Upper limit for the angle from the SecondaryAxis of Attachment0 to the SecondaryAxis of Attachment1 around the rotation axis. Value in [-180, 180]."
                },
                "LowerAngle": {
                    "summary": "Lower limit for the angle from the SecondaryAxis of Attachment0 to the SecondaryAxis of Attachment1 around the rotation axis. Value in [-180, 180]."
                },
                "AngularRestitution": {
                    "summary": "Restitution of the two limits, or how elastic they are. Value in [0,1]."
                },
                "AngularVelocity": {
                    "summary": "The target angular velocity of the motor in radians per second around the rotation axis. Value in [0, inf)."
                },
                "MotorMaxTorque": {
                    "summary": "The maximum torque the motor can apply to achieve the target angular velocity. Value in [0, inf)."
                },
                "MotorMaxAcceleration": {
                    "summary": "The maximum angular acceleration of the motor in radians per second square. Value in [0, inf)."
                },
                "AngularSpeed": {
                    "summary": "Target angular speed. This value is unsigned as the servo will always move toward its target. Value in [0, inf)."
                },
                "ServoMaxTorque": {
                    "summary": "Maximum torque the servo motor can apply. Value in [0, inf)."
                },
                "TargetAngle": {
                    "summary": "Target angle for the SecondaryAxis of Attachment1 from the SecondaryAxis of Attachment0 around the rotation axis. Value in [-180, 180]."
                },
                "CurrentAngle": {
                    "summary": "Signed angle between the SecondaryAxis of Attchement0 and the SecondaryAxis of Attachment1 around the rotation axis. Value in [-180, 180]."
                },
                "Radius": {
                    "summary": "Radius of the in-game visual. Value in [0, inf)."
                }
            }
        },
        "UniversalConstraint": {
            "members": {
                "LimitsEnabled": {
                    "summary": "Enables the angular limits on rotations around the main axis of Attachment0."
                },
                "MaxAngle": {
                    "summary": " Maximum angle between main axes of Attchement0 and Attachment1."
                },
                "Restitution": {
                    "summary": "Restitution of the two limits, or how elastic they are. Value in [0, 1]."
                },
                "CurrentAngle": {
                    "summary": "Current angle between the main axes of Attchement0 and Attachment1."
                },
                "Radius": {
                    "summary": "Radius of the in-game visual. Value in [0, inf)."
                }
            }
        },
        "SlidingBallConstraint": {
            "members": {
                "ActuatorType": {
                    "summary": "Type of linear actuator (along the axis of the slider): None, Motor, or Servo."
                },
                "LimitsEnabled": {
                    "summary": "Enables the limits on the linear motion along the axis of the slider."
                },
                "LowerLimit": {
                    "summary": "Lower limit for the position of Attachment1 with respect to Attachment0 along the slider axis. Value in (-inf, inf)."
                },
                "UpperLimit": {
                    "summary": "Upper limit for the position of Attachment1 with respect to Attachment0 along the slider axis. Value in (-inf, inf)."
                },
                "Restitution": {
                    "summary": "Restitution of the two limits, or how elastic they are. Value in [0, 1]."
                },
                "Velocity": {
                    "summary": "The target linear velocity of the motor in studs per second along the slider axis. Value in (-inf, inf)."
                },
                "MotorMaxForce": {
                    "summary": "The maximum force the motor can apply to achieve the target velocity. Units are mass * studs / seconds^2. Value in [0, inf)."
                },
                "MotorMaxAcceleration": {
                    "summary": "The maximum acceleration of the motor in studs per second squared. Value in [0, inf)."
                },
                "Speed": {
                    "summary": "Target speed in studs per second. This value is unsigned as the servo will always move toward its target. Value in [0, inf)."
                },
                "ServoMaxForce": {
                    "summary": "Maximum force the servo motor can apply. Units are mass * studs / seconds^2. Value in [0, inf)."
                },
                "TargetPosition": {
                    "summary": "Target position of Attachment1 with respect to Attachment0 along the slider axis. Value in (-inf, inf)."
                },
                "CurrentPosition": {
                    "summary": "Current position of Attachment1 with respect to Attachment0 along the slider axis. Value in (-inf, inf)."
                },
                "Size": {
                    "summary": "Size of the in-game visual associated with this constraint. Value in [0, inf)."
                }
            }
        },
        "CylindricalConstraint": {
            "members": {
                "InclinationAngle": {
                    "summary": "Direction of the rotation axis as an angle from the x-axis in the xy-plane of Attachment0. Value in [-180, 180]. "
                },
                "AngularActuatorType": {
                    "summary": "Type of angular actuator: None, Motor, or Servo. "
                },
                "AngularLimitsEnabled": {
                    "summary": "Enables the angular limits around the rotation axis."
                },
                "UpperAngle": {
                    "summary": "Upper limit for the angle (in degrees) between the reference axis and the SecondaryAxis of Attachment1 around the rotation axis. Value in [-180, 180]. "
                },
                "LowerAngle": {
                    "summary": "Lower limit for the angle (in degrees) between the reference axis and the SecondaryAxis of Attachment1 around the rotation axis. Value in [-180, 180]."
                },
                "AngularRestitution": {
                    "summary": "Restitution of the two limits, or how elastic they are. Value in [0, 1]. "
                },
                "AngularVelocity": {
                    "summary": "The target angular velocity of the motor in radians per second around the rotation axis. Value in [0, inf)."
                },
                "MotorMaxTorque": {
                    "summary": "The maximum torque the motor can apply to achieve the target angular velocity. The units are mass * studs^2 / second^2. Value in [0, inf)."
                },
                "MotorMaxAngularAcceleration": {
                    "summary": "The maximum angular acceleration of the motor in radians per second squared. Value in [0, inf)."
                },
                "AngularSpeed": {
                    "summary": "Target angular speed. This value is unsigned as the servo will always move toward its target. In radians per second. Value in [0, inf). "
                },
                "ServoMaxTorque": {
                    "summary": "Maximum torque the servo motor can apply. The units are mass * studs^2 / second^2. Value in [0, inf). "
                },
                "TargetAngle": {
                    "summary": " Target angle (in degrees) between the reference axis and the secondary axis of Attachment1 around the rotation axis. Value in [-180, 180]."
                },
                "CurrentAngle": {
                    "summary": "Signed angle (in degrees) between the reference axis and the secondary axis of Attachment1 around the rotation axis. Value in [-180, 180]. "
                },
                "WorldRotationAxis": {
                    "summary": "The unit vector direction of the rotation axis in world coordinates."
                },
                "RotationAxisVisible": {
                    "summary": "Enable the visibility of the rotation axis."
                }
            }
        },
        "Mouse": {
            "summary": "Used to receive input from the user. Actually tracks mouse events and keyboard events.",
            "members": {
                "Hit": {
                    "summary": "The CoordinateFrame of where the Mouse ray is currently hitting a 3D object in the Workspace.  If the mouse is not over any 3D objects in the Workspace, this property is nil."
                },
                "Icon": {
                    "summary": "The current Texture of the Mouse Icon. Stored as a string, for more information on how to format the string <a href='http://wiki.roblox.com/index.php/Content' target='_blank'>go here</a>"
                },
                "Origin": {
                    "summary": "The CoordinateFrame of where the Mouse is when the mouse is not clicking.  This CoordinateFrame will be very close to the Camera.CoordinateFrame."
                },
                "Target": {
                    "summary": "The Part the mouse is currently over. If the mouse is not currently over any object (on the skybox, for example) this property is nil."
                },
                "TargetFilter": {
                    "summary": "A Part or Model that the Mouse will ignore when trying to find the Target, TargetSurface and Hit."
                },
                "TargetSurface": {
                    "summary": "The NormalId (Top, Left, Down, etc.) of the face of the part the Mouse is currently over."
                },
                "UnitRay": {
                    "summary": "The Unit Ray from where the mouse is (Origin) to the current Mouse.Target."
                },
                "ViewSizeX": {
                    "summary": "The viewport's (game window) width in pixels."
                },
                "ViewSizeY": {
                    "summary": "The viewport's (game window) height in pixels."
                },
                "X": {
                    "summary": "The absolute pixel position of the Mouse along the x-axis of the viewport (game window). Values start at 0 on the left hand side of the screen and increase to the right."
                },
                "Y": {
                    "summary": "The absolute pixel position of the Mouse along the y-axis of the viewport (game window). Values start at 0 on the top of the screen and increase to the bottom."
                },
                "Button1Down": {
                    "summary": "Fired when the first button (usually the left, but could be another) on the mouse is depressed."
                },
                "Button1Up": {
                    "summary": "Fired when the first button (usually the left, but could be another) on the mouse is release."
                },
                "Button2Down": {
                    "summary": "This event is currently non-operational."
                },
                "Button2Up": {
                    "summary": "This event is currently non-operational."
                },
                "Idle": {
                    "summary": "Fired constantly when the mouse is not firing any other event (i.e. the mouse isn't moving, nor any buttons being pressed or depressed)."
                },
                "KeyDown": {
                    "summary": "Fired when a user presses a key on the keyboard. Argument is a string representation of the key.  If the key has no string representation (such as space), the string passed in is the keycode for that character. Keycodes are currently in ASCII."
                },
                "KeyUp": {
                    "summary": "Fired when a user releases a key on the keyboard. Argument is a string representation of the key.  If the key has no string representation (such as space), the string passed in is the keycode for that character. Keycodes are currently in ASCII."
                },
                "Move": {
                    "summary": "Fired when the mouse X or Y member changes."
                },
                "WheelBackward": {
                    "summary": "This event is currently non-operational."
                },
                "WheelForward": {
                    "summary": "This event is currently non-operational."
                }
            }
        },
        "TaskScheduler": {
            "members": {
                "SetThreadShare": {
                    "summary": "Deprecated"
                }
            }
        },
        "ClickDetector": {
            "summary": "Raises mouse events for parent object",
            "members": {
                "MaxActivationDistance": {
                    "summary": "The maximum distance a Player's character can be from the ClickDetector's parent Part that will allow the Player's mouse to fire events on this object."
                },
                "MouseClick": {
                    "summary": "Fired when a player clicks on the parent Part of ClickDetector. The argument provided is always of type Player."
                },
                "MouseHoverEnter": {
                    "summary": "Fired when a player's mouse enters on the parent Part of ClickDetector. The argument provided is always of type Player."
                },
                "MouseHoverLeave": {
                    "summary": "Fired when a player's mouse leaves the parent Part of ClickDetector. The argument provided is always of type Player."
                }
            }
        },
        "ProximityPrompt": {
            "summary": "Provides a UI for the player to interact with an object when near.",
            "members": {
                "MaxActivationDistance": {
                    "summary": "The maximum distance a Player's character can be from the ProximityPrompt for the prompt to appear."
                },
                "ActionText": {
                    "summary": "The action text shown to the user."
                },
                "ObjectText": {
                    "summary": "The object name text shown to the user."
                },
                "KeyboardKeyCode": {
                    "summary": "The key the player should press to trigger the prompt."
                },
                "GamepadKeyCode": {
                    "summary": "The gamepad button the player should press to trigger the prompt."
                },
                "Enabled": {
                    "summary": "When false, this prompt will not be shown, and events will not fire."
                },
                "HoldDuration": {
                    "summary": "The user must hold the button down for this duration to trigger the prompt."
                },
                "Exclusivity": {
                    "summary": "Describes which prompts will be shown when multiple may be visible."
                },
                "Style": {
                    "summary": "When set to custom, no default UI will be provided."
                },
                "UIOffset": {
                    "summary": "a pixel offset applied to the UI."
                },
                "RequiresLineOfSight": {
                    "summary": "If true, this prompt will only be shown if there is a clear path from the camera to the object."
                },
                "InputHoldBegin": {
                    "summary": "Used to signal that the player began triggering this prompt."
                },
                "InputHoldEnd": {
                    "summary": "Used to signal that the player ended triggering this prompt."
                },
                "Triggered": {
                    "summary": "Fired when a player triggers the ProximityPrompt."
                },
                "TriggeEnded": {
                    "summary": "Fired when a player releases a button to end triggering the ProximityPrompt."
                },
                "PromptShown": {
                    "summary": "Fired in local scripts when this prompt is shown.  Can be used for customization."
                },
                "PromptHidden": {
                    "summary": "Fired in local scripts when this prompt is hidden.  Can be used for customization."
                },
                "PromptButtonHoldBegan": {
                    "summary": "Fired in local scripts when the user begins holding down the button on a prompt with a non-zero HoldDuration.  This can be used to animate a progress bar."
                },
                "PromptButtonHoldEnded": {
                    "summary": "Fired in local scripts when the user ends holding down the button on a prompt with a non-zero HoldDuration.  This can be used to animate a progress bar."
                }
            }
        },
        "ProximityPromptService": {
            "members": {
                "Enabled": {
                    "summary": "When false, no prompts will be shown."
                },
                "MaxPromptsVisible": {
                    "summary": "The maximum number of ProximityPrompts that will be shown."
                },
                "Triggered": {
                    "summary": "Fired when a player triggers the ProximityPrompt."
                },
                "TriggeEnded": {
                    "summary": "Fired when a player releases a button to end triggering the ProximityPrompt."
                },
                "PromptShown": {
                    "summary": "Fired in local scripts when a prompt is shown.  Can be used for customization."
                },
                "PromptHidden": {
                    "summary": "Fired in local scripts when a prompt is hidden.  Can be used for customization."
                },
                "PromptButtonHoldBegan": {
                    "summary": "Fired in local scripts when the user begins holding down the button on a prompt with a non-zero HoldDuration.  This can be used to animate a progress bar."
                },
                "PromptButtonHoldEnded": {
                    "summary": "Fired in local scripts when the user ends holding down the button on a prompt with a non-zero HoldDuration.  This can be used to animate a progress bar."
                }
            }
        },
        "Smoke": {
            "summary": "Makes the parent part or model object emit smoke"
        },
        "Trail": {
            "summary": "Makes two attachments emit trail when moving"
        },
        "Beam": {
            "summary": "Makes beam between two attachments"
        },
        "SurfaceAppearance": {
            "summary": "Overrides the visual appearance of its parent MeshPart",
            "members": {
                "AlphaMode": {
                    "summary": "Determines how the ColorMap's alpha channel behaves. Not scriptable at runtime."
                },
                "ColorMap": {
                    "summary": "Image ID used to color the surface. If left empty, surface uses Part Color. Not scriptable at runtime."
                },
                "MetalnessMap": {
                    "summary": "Grayscale Image ID that determines the metalness of the surface. Not scriptable at runtime."
                },
                "NormalMap": {
                    "summary": "Image ID of the normal map used to control surface bumps and curvature. Not scriptable at runtime."
                },
                "RoughnessMap": {
                    "summary": "Grayscale Image ID that determines the roughness of the surface. Not scriptable at runtime."
                },
                "TexturePack": {
                    "summary": "Internal asset link"
                }
            }
        },
        "ParticleEmitter": {
            "summary": "A generic particle system.",
            "members": {
                "LightInfluence": {
                    "summary": "Specifies the amount of influence lighting has on the particle emmitter. A value of 0 is unlit, 1 is fully lit. Fractional values blend from unlit to lit."
                },
                "TimeScale": {
                    "summary": "Slows down the particle simulation speed. 1 is normal speed (behaves as before), 0.5 is half-rate, and 0 means all particles will stop moving."
                }
            }
        },
        "PathfindingModifier": {
            "summary": "Pathfinding Modifiers can be used to represent space that has a higher or lower cost to be traversed.",
            "members": {
                "Label": {
                    "summary": "The name of the navigation area inside or on top of the Part's volume."
                },
                "PassThrough": {
                    "summary": "Determines if the Part(s) enclosed by this Pathfinding Modifier are traversable, even if they are collidable (e.g. a door)."
                }
            }
        },
        "PathfindingLink": {
            "summary": "Pathfinding link can be used to connect areas in the place which otherwise are unconnected.",
            "members": {
                "Attachment0": {
                    "summary": "The Attachment instance which is the source of the link."
                },
                "Attachment1": {
                    "summary": "The Attachment instance which is the destination of the link."
                },
                "Label": {
                    "summary": "The link identifier used to set a cost for the link when calling PathfindingService:CreatePath."
                },
                "IsBidirectional": {
                    "summary": "Specifies if the link is bidirectional; default is true."
                }
            }
        },
        "Sparkles": {
            "summary": "Makes the parent part or model object fantastic"
        },
        "Explosion": {
            "summary": "Creates an Explosion! This can be used as a purely graphical effect, or can be made to damage objects.",
            "members": {
                "BlastPressure": {
                    "summary": "How much force this Explosion exerts on objects within it's BlastRadius. Setting this to 0 creates a purely graphical effect. A larger number will cause Parts to fly away at higher velocities."
                },
                "BlastRadius": {
                    "summary": "How big the Explosion is. This is a circle starting from the center of the Explosion's Position, the larger this property the larger the circle of destruction."
                },
                "Position": {
                    "summary": "Where the Explosion occurs in absolute world coordinates."
                },
                "ExplosionType": {
                    "summary": "Defines the behavior of the Explosion. <a href='http://wiki.roblox.com/index.php/ExplosionType' target='_blank'>More info</a>"
                }
            }
        },
        "Fire": {
            "summary": "Makes the parent part or model object emit fire",
            "members": {
                "Color": {
                    "summary": "The color of the base of the fire.  See SecondaryColor for more."
                },
                "Heat": {
                    "summary": "How hot the fire appears to be. The flame moves quicker the higher this value is set."
                },
                "SecondaryColor": {
                    "summary": "The color the fire interpolates to from Color. The longer a particle exists in the fire, the close to this color it becomes."
                },
                "Size": {
                    "summary": "How large the fire appears to be."
                }
            }
        },
        "Platform": {
            "summary": "Equivalent to a seat, except that the character stands up rather than sits down."
        },
        "VehicleSeat": {
            "summary": "Automatically finds and powers hinge joints in an assembly.  Ignores motors."
        },
        "Flag": {
            "members": {
                "CanBeDropped": {
                    "summary": "If someone is carrying this flag, this bool determines whether or not they can drop it and run."
                },
                "TeamColor": {
                    "summary": "The Team this flag is for. Corresponds with the TeamColors in the Teams service."
                }
            }
        },
        "Decal": {
            "summary": "Describes a texture that is placed on one of the sides of the Part it is parented to.",
            "members": {
                "Face": {
                    "summary": "Describes the face of the Part the decal will be applied to. <a href='http://wiki.roblox.com/index.php/NormalId' target='_blank'>More info</a>"
                },
                "Shiny": {
                    "summary": "How much light will appear to reflect off of the decal."
                },
                "Specular": {
                    "summary": "How light will react to the surface of the decal."
                },
                "Transparency": {
                    "summary": "How visible the decal is.  1 is completely invisible, while 0 is completely opaque"
                }
            }
        },
        "JointInstance": {
            "members": {
                "Active": {
                    "summary": "Read-only boolean, true if the joint is active in world. Rigid joints may be inactive if they are redundant or form cycles."
                }
            }
        },
        "IntValue": {
            "summary": "Stores a int value in it's Value member. Useful to share int information across multiple scripts."
        },
        "RayValue": {
            "summary": "Stores a Ray value in it's Value member. Useful to share Ray information across multiple scripts."
        },
        "IntConstrainedValue": {
            "summary": "Stores an int value in it's Value member.  Value is clamped to be in range of Min and MaxValue. Useful to share int information across multiple scripts.",
            "members": {
                "MaxValue": {
                    "summary": "The maximum we allow this Value to be set.  If Value is set higher than this, it automatically gets adjusted to MaxValue"
                },
                "MinValue": {
                    "summary": "The minimum we allow this Value to be set.  If Value is set lower than this, it automatically gets adjusted to MinValue"
                }
            }
        },
        "DoubleConstrainedValue": {
            "summary": "Stores a double value in it's Value member.  Value is clamped to be in range of Min and MaxValue. Useful to share double information across multiple scripts.",
            "members": {
                "MaxValue": {
                    "summary": "The maximum we allow this Value to be set.  If Value is set higher than this, it automatically gets adjusted to MaxValue"
                },
                "MinValue": {
                    "summary": "The minimum we allow this Value to be set.  If Value is set lower than this, it automatically gets adjusted to MinValue"
                }
            }
        },
        "BoolValue": {
            "summary": "Stores a boolean value in it's Value member. Useful to share boolean information across multiple scripts."
        },
        "FloorWire": {
            "summary": "Renders a thin cylinder than can be adorned with textures that 'flow' from one object to the next. Has basic pathing abilities and attempts to to not intersect anything. <a href='http://wiki.roblox.com/index.php/FloorWire_Guide' target='_blank'>More info</a>",
            "members": {
                "CycleOffset": {
                    "summary": "Controls how the decals are positioned along the wire. <a href='http://wiki.roblox.com/index.php/CycleOffset' target='_blank'>More info</a>"
                },
                "From": {
                    "summary": "The object the FloorWire 'emits' from"
                },
                "StudsBetweenTextures": {
                    "summary": "The space between two textures on the wire. Note: studs are relative depending on how far the camera is from the FloorWire."
                },
                "Texture": {
                    "summary": "The image we use to render the textures that flow from beginning to end of the FloorWire."
                },
                "TextureSize": {
                    "summary": "The size in studs of the Texture we use to flow from one object to the next."
                },
                "To": {
                    "summary": "The object the FloorWire 'emits' to"
                },
                "Velocity": {
                    "summary": "The rate of travel that the textures flow along the wire."
                },
                "WireRadius": {
                    "summary": "How thick the wire is."
                }
            }
        },
        "CFrameValue": {
            "summary": "Stores a CFrame value in it's Value member. Useful to share CFrame information across multiple scripts."
        },
        "Color3Value": {
            "summary": "Stores a Color3 value in it's Value member. Useful to share Color3 information across multiple scripts."
        },
        "BrickColorValue": {
            "summary": "Stores a BrickColor value in it's Value member. Useful to share BrickColor information across multiple scripts."
        },
        "ValueBase": {
            "summary": "The base class to all Value Objects."
        },
        "Sound": {
            "members": {
                "play": {
                    "summary": "Deprecated. Use Play() instead"
                },
                "PlayOnRemove": {
                    "summary": "The sound will play when it is removed from the Workspace. Looped sounds don't play"
                }
            }
        },
        "EchoSoundEffect": {
            "summary": "An echo audio effect that can be applied to a Sound or SoundGroup."
        },
        "FlangeSoundEffect": {
            "summary": "A Flanging audio effect that can be applied to a Sound or SoundGroup."
        },
        "DistortionSoundEffect": {
            "summary": "A Distortion audio effect that can be applied to a Sound or SoundGroup."
        },
        "PitchShiftSoundEffect": {
            "summary": "A Pitch Shifting audio effect that can be applied to a Sound or SoundGroup."
        },
        "ChorusSoundEffect": {
            "summary": "A Chorus audio effect that can be applied to a Sound or SoundGroup."
        },
        "TremoloSoundEffect": {
            "summary": "A Tremolo audio effect that can be applied to a Sound or SoundGroup."
        },
        "ReverbSoundEffect": {
            "summary": "A Reverb audio effect that can be applied to a Sound or SoundGroup."
        },
        "EqualizerSoundEffect": {
            "summary": "An Three-band Equalizer audio effect that can be applied to a Sound or SoundGroup."
        },
        "CompressorSoundEffect": {
            "summary": "A Compressor audio effect that can be applied to a Sound or SoundGroup."
        },
        "SoundService": {
            "members": {
                "AmbientReverb": {
                    "summary": "The ambient sound environment.  May not work when using hardware sound"
                },
                "DopplerScale": {
                    "summary": "The doppler scale is a general scaling factor for how much the pitch varies due to doppler shifting in 3D sound. Doppler is the pitch bending effect when a sound comes towards the listener or moves away from it, much like the effect you hear when a train goes past you with its horn sounding. With dopplerscale you can exaggerate or diminish the effect."
                },
                "DistanceFactor": {
                    "summary": "the relative distance factor, compared to 1.0 meters."
                },
                "RolloffScale": {
                    "summary": "Setting this value makes the sound drop off faster or slower. The higher the value, the faster volume will attenuate, and conversely the lower the value, the slower it will attenuate. For example a rolloff factor of 1 will simulate the real world, where as a value of 2 will make sounds attenuate 2 times quicker."
                }
            }
        },
        "UIGridStyleLayout": {
            "members": {
                "SetCustomSortFunction": {
                    "summary": "When SortOrder is set to Custom, this lua function is used to determine the ordering of elements. Function should take two arguments (each will be an Instance child to compare), and return true if a comes before b, otherwise return false. In other words, use this function the same way you would use a table.sort function. The sorting should be deterministic, otherwise sort will fail and fall back to name order."
                },
                "ApplyLayout": {
                    "summary": "Forces a relayout of all elements. Useful when sort is set to Custom."
                },
                "SortOrder": {
                    "summary": "Determines how we decide which element to place next. Can be Name or Custom. If using Custom, make sure SetCustomSortFunction was called with an appropriate sort function."
                },
                "FillDirection": {
                    "summary": "Determines which direction to fill the grid. Can be Horizontal or Vertical."
                },
                "HorizontalAlignment": {
                    "summary": "Determines how grid is placed within it's parent's container in the x direction. Can be Left, Center, or Right."
                },
                "VerticalAlignment": {
                    "summary": "Determines how grid is placed within it's parent's container in the y direction. Can be Top, Center, or Bottom."
                }
            }
        },
        "UIListLayout": {
            "summary": "Sets the position of UI elements in a list. You can use a UIListLayout by parenting it to a GuiObject. The UIListLayout will then apply itself to all of its GuiObject siblings.",
            "members": {
                "Padding": {
                    "summary": "Determines the amount of free space between each element. Can be set either using scale (Percentage of parent's size in the current direction) or offset (a static spacing value, similar to pixel size)."
                }
            }
        },
        "UIGridLayout": {
            "summary": "Sets the position of UI elements in a 2D grid (this can be modified to 1D grid for list layout). This will also set the elements to a particular size, although this can be overridden with particular constraints on elements. You can use a UIGridLayout by parenting it to a GuiObject. The UIGridLayout will then apply itself to all of its GuiObject siblings.",
            "members": {
                "CellSize": {
                    "summary": "Denotes what size each element should be. Can be overridden by elements using constraints on individual elements."
                },
                "CellPadding": {
                    "summary": "How much space between elements there should be."
                },
                "FillDirectionMaxCells": {
                    "summary": "Determines how many cells over in the FillDirection we go before starting a new row or column. Set to 0 for max cell count.  Will be clamped if this is set higher than the parent container allows room for."
                },
                "AbsoluteSize": {
                    "summary": "Returns the current size of the grid. If more elements are added, this can increase. If elements are removed this can decrease."
                },
                "StartCorner": {
                    "summary": "Which corner we start laying the elements out from. Can be TopLeft, TopRight, BottomLeft, BottomRight."
                }
            }
        },
        "UIPageLayout": {
            "summary": "Creates a paged viewing window, like the home screen of a mobile device. You can use a UIPageLayout by parenting it to a GuiObject. The UIPageLayout will then apply itself to all of its GuiObject siblings.",
            "members": {
                "CurrentPage": {
                    "summary": "The page that is either currently being displayed or is the target of the current animation."
                },
                "Circular": {
                    "summary": "Whether or not the page layout wraps around at the ends."
                },
                "Padding": {
                    "summary": "Determines the amount that pages are separated from each other by. Can be set either using scale (Percentage of parent's size in the current direction) or offset (a static spacing value, similar to pixel size)."
                },
                "Animated": {
                    "summary": "Whether or not to animate transitions between pages."
                },
                "EasingStyle": {
                    "summary": "The easing style to use when performing an animation."
                },
                "EasingDirection": {
                    "summary": "The easing direction to use when performing an animation."
                },
                "TweenTime": {
                    "summary": "The length of the animation."
                },
                "Next": {
                    "summary": "Sets CurrentPage to the page after the current page and animates to it, or does nothing if there isn't a next page."
                },
                "Previous": {
                    "summary": "Sets CurrentPage to the page after the current page and animates to it, or does nothing if there isn't a next page."
                },
                "JumpTo": {
                    "summary": "If the instance is in the layout, then it sets CurrentPage to it and animtes to it. If circular layout is set, it will take the shortest path."
                },
                "JumpToIndex": {
                    "summary": "If the index is >= 0 and less than the size of the layout, acts like JumpTo. If it's out of bounds and circular is set, it will animate the full distance between the in-bounds index of CurrentPage and the new index."
                },
                "PageEnter": {
                    "summary": "Fires when a page comes into view, and is going to be rendered."
                },
                "PageLeave": {
                    "summary": "Fires when a page leaves view, and will not be rendered."
                },
                "Stopped": {
                    "summary": "Fires when an animation to CurrentPage is completed without being cancelled, and the view stops scrolling."
                }
            }
        },
        "UITableLayout": {
            "summary": "Provides a layout of rows and columns that are sized based on the cells in them.",
            "members": {
                "Padding": {
                    "summary": "The amount of padding to insert in between the cells of the table."
                },
                "FillEmptySpaceRows": {
                    "summary": "Whether the table should expand to fill the available space of its container, row-wise."
                },
                "FillEmptySpaceColumns": {
                    "summary": "Whether the table should expand to fill the available space of its container, column-wise."
                },
                "MajorAxis": {
                    "summary": "Whether the direct siblings are considered the rows or the columns. The children of the direct siblings are the columns or rows, respectively."
                }
            }
        },
        "UISizeConstraint": {
            "summary": "Ensures a GuiObject does not become smaller or larger than the min and max size. If an element with a constraint is under the control of a layout, the constraint takes precedence in determining the element’s size, but not position. You can use a Constraint by parenting it to the element you wish to constrain.",
            "members": {
                "MinSize": {
                    "summary": "The smallest size the GuiObject is allowed to be."
                },
                "MaxSize": {
                    "summary": "The biggest size the GuiObject is allowed to be."
                }
            }
        },
        "UITextSizeConstraint": {
            "summary": "Ensures a GuiObject with text does not allow the font size to become larger or smaller than min and max text sizes. If an element with a constraint is under the control of a layout, the constraint takes precedence in determining the element’s size, but not position. You can use a Constraint by parenting it to the element you wish to constrain.",
            "members": {
                "MinTextSize": {
                    "summary": "The smallest size the font is allowed to be."
                },
                "MaxTextSize": {
                    "summary": "The biggest size the font is allowed to be."
                }
            }
        },
        "UIAspectRatioConstraint": {
            "summary": "Ensures a GuiObject will always have a particular aspect ratio. If an element with a constraint is under the control of a layout, the constraint takes precedence in determining the element’s size, but not position. You can use a Constraint by parenting it to the element you wish to constrain.",
            "members": {
                "AspectRatio": {
                    "summary": "The aspect ratio to maintain. This is the width/height. Only positive numbers allowed."
                },
                "AspectType": {
                    "summary": "Describes how the aspect ratio will determine its size. Options are FitWithinMaxSize, ScaleWithParentSize. FitWithinMaxSize will make the element the maximum size it can be within the current possible AbsoluteSize of the element while maintaining the AspectRatio. ScaleWithParentSize will make the element the closest to the parent element’s maximum size while maintaining aspect ratio."
                },
                "DominantAxis": {
                    "summary": "Describes which axis to use when determining the new size of the element, while keeping respect to the aspect ratio."
                }
            }
        },
        "UIScale": {
            "summary": "Uniformly scales a GUI object and all its children.",
            "members": {
                "Scale": {
                    "summary": "The scale factor to apply."
                }
            }
        },
        "UIPadding": {
            "members": {
                "PaddingLeft": {
                    "summary": "The padding to apply on the left side relative to the parent's normal size."
                },
                "PaddingRight": {
                    "summary": "The padding to apply on the right side relative to the parent's normal size."
                },
                "PaddingTop": {
                    "summary": "The padding to apply on the top side relative to the parent's normal size."
                },
                "PaddingBottom": {
                    "summary": "The padding to apply on the bottom side relative to the parent's normal size."
                }
            }
        },
        "UIGradient": {
            "summary": "Apply a gradient to the parent GuiObject.",
            "members": {
                "Color": {
                    "summary": "The (sequence of) color3 of the gradient."
                },
                "Transparency": {
                    "summary": "The (sequence of) transparency of the gradient."
                },
                "Rotation": {
                    "summary": "Clockwise rotation in degrees."
                },
                "Offset": {
                    "summary": "Offset of gradient center in scale."
                }
            }
        },
        "UICorner": {
            "summary": "Modify corner properties of parent GuiObject.",
            "members": {
                "CornerRadius": {
                    "summary": "Round corner with specified radius."
                }
            }
        },
        "UIStroke": {
            "summary": "Applies an outline around a UI object. This can be used on both borders and text.",
            "members": {
                "Color": {
                    "summary": "The color used for the outline."
                },
                "Transparency": {
                    "summary": "The transparency of the outline from 0 to 1."
                },
                "Thickness": {
                    "summary": "The thickness of the outline in pixels."
                },
                "Enabled": {
                    "summary": "Allows disabling the object's effect temporarily."
                },
                "LineJoinMode": {
                    "summary": "Controls how sharp corners are connected together for the outline."
                },
                "ApplyStrokeMode": {
                    "summary": "Allows controlling whether this object should be applied to borders or to text. This allows for two stroke objects to be used for different tasks on the same text object."
                }
            }
        },
        "TweenBase": {
            "members": {
                "PlaybackState": {
                    "summary": "The current state of how the tween is animating. Possible values are Begin, Playing, Paused, Completed and Cancelled. This property is modified by using functions such as Tween:Play(), Tween:Pause(), and Tween:Cancel(). Read-only."
                },
                "Play": {
                    "summary": "Starts or resumes (if Tween.PlaybackState is Paused) the tween animation. If current PlaybackState is Cancelled, this property will reset the tween to the beginning properties and play the animations from the beginning."
                },
                "Pause": {
                    "summary": "Temporarily stops the tween animation. Animation can be resumed by calling Play()."
                },
                "Cancel": {
                    "summary": "Stops the tween animation. Animation can be restarted by calling Play(). Animation will start from the beginning values."
                },
                "Completed": {
                    "summary": "Fires when the tween either reaches PlaybackState Completed or Cancelled. PlaybackState of one of these types is passed as the first arg to the function listening to this event."
                }
            }
        },
        "Tween": {
            "summary": "An object linked to an instance that animates properties on the instance over a specified period of time. Useful for easily moving UI objects around, rotating objects, etc. without having to write a lot of code. To create a new tween, please use TweenService:Create.",
            "members": {
                "Instance": {
                    "summary": "The object this tween is operating on. Read-only."
                },
                "TweenInfo": {
                    "summary": "Specifies how the tween animates. Read-only."
                }
            }
        },
        "TweenService": {
            "summary": "Service responsible for creating tweens on instances.",
            "members": {
                "Create": {
                    "summary": "Creates a Tween object bound to a particular Instance. The first arg is the Instance to tween. The second arg is a TweenInfo struct, which specifies how a tween should behave. The third arg is a table, which should specify the properties to tween as keys, with the end value specified as values to the keys."
                },
                "GetValue": {
                    "summary": "Transforms a linear alpha to a given EasingStyle and EasingDirection."
                }
            }
        },
        "StarterGui": {
            "members": {
                "SetCoreGuiEnabled": {
                    "summary": "Will stop/begin certain core gui elements being rendered. See CoreGuiType for core guis that can be modified."
                },
                "GetCoreGuiEnabled": {
                    "summary": "Returns a boolean describing whether a CoreGuiType is currently being rendered."
                }
            }
        },
        "GuiService": {
            "summary": "The GuiService is a special service, which currently allows developers to control what GuiObject is currently being selected by the Gamepad Gui navigator, and allows clients to check if Roblox's main menu is currently open. This service has a lot of hidden members, which are mainly used internally by Roblox's CoreScripts.",
            "members": {
                "GetGuiInset": {
                    "summary": "Returns a Tuple containing two Vector2 values representing the offset of user GUIs in pixels from the top right corner of the screen and the bottom right corner of the screen respectively."
                }
            }
        },
        "ContextActionService": {
            "summary": "A service used to bind input to various lua functions.",
            "members": {
                "BindAction": {
                    "summary": "Binds 'functionToBind' to fire when any 'inputTypes' happen. InputTypes can be variable in number and type. Types can be Enum.KeyCode, single character strings corresponding to keys, or Enum.UserInputType. 'actionName' is a key used by many other ContextActionService functions to query state. 'createTouchButton' if true will create a button on screen on touch devices.  This button will fire 'functionToBind' with three arguments: first argument is the actionName, second argument is the UserInputState of the input, and the third is the InputObject that fired this function. If 'functionToBind' yields or returns nil or Enum.ContextActionResult.Sink, the input will be sunk. If it returns Enum.ContextActionResult.Pass, the next bound action in the stack will be invoked."
                },
                "SetTitle": {
                    "summary": "If 'actionName' key contains a bound action, then 'title' is set as the title of the touch button. Does nothing if a touch button was not created. No guarantees are made whether title will be set when button is manipulated."
                },
                "SetDescription": {
                    "summary": "If 'actionName' key contains a bound action, then 'description' is set as the description of the bound action. This description will appear for users in a listing of current actions availables."
                },
                "SetImage": {
                    "summary": "If 'actionName' key contains a bound action, then 'image' is set as the image of the touch button. Does nothing if a touch button was not created. No guarantees are made whether image will be set when button is manipulated."
                },
                "SetPosition": {
                    "summary": "If 'actionName' key contains a bound action, then 'position' is set as the position of the touch button. Does nothing if a touch button was not created. No guarantees are made whether position will be set when button is manipulated."
                },
                "UnbindAction": {
                    "summary": "If 'actionName' key contains a bound action, removes function from being called by all input that it was bound by (if function was also bound by a different action name as well, those bound input are still active). Will also remove any touch button created (if button was manipulated manually there is no guarantee it will be cleaned up)."
                },
                "UnbindAllActions": {
                    "summary": "Removes all functions bound. No actionNames will remain. All touch buttons will be removed. If button was manipulated manually there is no guarantee it will be cleaned up."
                },
                "GetBoundActionInfo": {
                    "summary": "Returns a table with info regarding the function bound with 'actionName'. Table has the keys 'title' (current title that was set with SetTitle) 'image' (image set with SetImage) 'description' (description set with SetDescription) 'inputTypes' (tuple containing all input bound for this 'actionName') 'createTouchButton' (whether or not we created a touch button for this 'actionName'). "
                },
                "GetAllBoundActionInfo": {
                    "summary": "Returns a table with all bound action info. Each entry is a key with 'actionName' and value being the same table you would get from ContextActionService:GetBoundActionInfo('actionName')."
                },
                "GetButton": {
                    "summary": "If 'actionName' key contains a bound action, then this will return the touch button (if was created). Returns nil if a touch button was not created. No guarantees are made whether button will be retrievable when button is manipulated."
                }
            }
        },
        "PointsService": {
            "summary": "A service used to query and award points for Roblox users using the universal point system.",
            "members": {
                "PointsAwarded": {
                    "summary": "Fired when points are successfully awarded 'userId'. Also returns the updated balance of points for usedId in universe via 'userBalanceInUniverse', total points via 'userTotalBalance', and the amount points that were awarded via 'pointsAwarded'. This event fires on the server and also all clients in the game that awarded the points."
                },
                "AwardPoints": {
                    "summary": "Will attempt to award the 'amount' points to 'userId', returns 'userId' awarded to, the number of points awarded, the new point total the user has in the game, and the total number of points the user now has. Will also fire PointsService.PointsAwarded. Works with server scripts ONLY."
                },
                "GetPointBalance": {
                    "summary": "Returns the overall balance of points that player with userId has (the sum of all points across all games). Works with server scripts ONLY."
                },
                "GetGamePointBalance": {
                    "summary": "Returns the balance of points that player with userId has in the current game (all placeID points combined within the game). Works with server scripts ONLY."
                },
                "GetAwardablePoints": {
                    "summary": "Returns the number of points the current universe can award to players. Works with server scripts ONLY."
                }
            }
        },
        "LocalizationTable": {
            "summary": "A database of strings used in the game and their translations."
        },
        "LocalizationService": {
            "members": {
                "PreferredLanguage": {
                    "summary": "Gets the system's preferred language (A Language enum)."
                },
                "GetLocaleId": {
                    "summary": "Gets the system's LocaleId (Ex: \"en-US\")."
                }
            }
        },
        "MarketplaceService": {
            "members": {
                "PromptPurchase": {
                    "summary": "Will prompt 'player' to purchase the item associated with 'assetId'.  'equipIfPurchased' is an optional argument that will give the item to the player immediately if they buy it (only applies to gear).  'currencyType' is also optional and will attempt to prompt the user with a specified currency if the product can be purchased with this currency, otherwise we use the default currency of the product."
                },
                "GetProductInfo": {
                    "summary": "Takes one argument \"assetId\" which should be a number of an asset on www.roblox.com.  Returns a table containing the product information (if this process fails, returns an empty table)."
                },
                "PlayerOwnsAsset": {
                    "summary": "Checks to see if 'Player' owns the product associated with 'assetId'. Returns true if the player owns it, false otherwise. This call will produce a warning if called on a guest player."
                },
                "ProcessReceipt": {
                    "summary": "Callback that is executed for pending Developer Product receipts.\n            <p>If this function does not return Enum.ProductPurchaseDecision.PurchaseGranted, then you will not be granted the money for the purchase!</p>\n            <p>The callback will be invoked with a table, containing the following informational fields:</p>\n            <ul>\n            <li>PlayerId: int64 - the id of the player making the purchase.</li>\n            <li>PlaceIdWherePurchased: int64:  - the specific place where the purchase was made.</li>\n            <li>PurchaseId: string - a unique identifier for the purchase, should be used to prevent granting an item multiple times for one purchase.</li>\n            <li>ProductId: int64 - the id of the purchased product.</li>\n            <li>CurrencyType: CurrencyType - the type of currency used (Tix, Robux).</li>\n            <li>CurrencySpent: int - the amount of currency spent on the product for this purchase.</li>\n            </ul>\n            "
                },
                "PromptPurchaseFinished": {
                    "summary": "Fired when a 'player' dismisses a purchase dialog for 'assetId'.  If the player purchased the item 'isPurchased' will be true, otherwise it will be false. This call will produce a warning if called on a guest player."
                }
            }
        },
        "UserInputService": {
            "members": {
                "TouchEnabled": {
                    "summary": "Returns true if the local device accepts touch input, false otherwise."
                },
                "KeyboardEnabled": {
                    "summary": "Returns true if the local device accepts keyboard input, false otherwise."
                },
                "MouseEnabled": {
                    "summary": "Returns true if the local device accepts mouse input, false otherwise."
                },
                "AccelerometerEnabled": {
                    "summary": "Returns true if the local device has an accelerometer, false otherwise."
                },
                "GyroscopeEnabled": {
                    "summary": "Returns true if the local device has an gyroscope, false otherwise."
                },
                "TouchTap": {
                    "summary": "Fired when a user taps their finger on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the tap gesture. This event only fires locally.  This event will always fire regardless of game state."
                },
                "TouchPinch": {
                    "summary": "Fired when a user pinches their fingers on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the pinch gesture. 'scale' is a float that indicates the difference from the beginning of the pinch gesture. 'velocity' is a float indicating how quickly the pinch gesture is happening. 'state' indicates the Enum.UserInputState of the gesture.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "TouchSwipe": {
                    "summary": "Fired when a user swipes their fingers on a TouchEnabled device. 'swipeDirection' is an Enum.SwipeDirection, indicating the direction the user swiped. 'numberOfTouches' is an int that indicates how many touches were involved with the gesture.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "TouchLongPress": {
                    "summary": "Fired when a user holds at least one finger for a short amount of time on the same screen position on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the gesture. 'state' indicates the Enum.UserInputState of the gesture.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "TouchRotate": {
                    "summary": "Fired when a user rotates two fingers on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the gesture. 'rotation' is a float indicating how much the rotation has gone from the start of the gesture. 'velocity' is a float that indicates how quickly the gesture is being performed. 'state' indicates the Enum.UserInputState of the gesture.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "TouchPan": {
                    "summary": "Fired when a user drags at least one finger on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the gesture. 'totalTranslation' is a Vector2, indicating how far the pan gesture has gone from its starting point. 'velocity' is a Vector2 that indicates how quickly the gesture is being performed in each dimension. 'state' indicates the Enum.UserInputState of the gesture.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "TouchStarted": {
                    "summary": "Fired when a user places their finger on a TouchEnabled device. 'touch' is an InputObject, which contains useful data for querying user input.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "TouchMoved": {
                    "summary": "Fired when a user moves their finger on a TouchEnabled device. 'touch' is an InputObject, which contains useful data for querying user input.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "TouchEnded": {
                    "summary": "Fired when a user moves their finger on a TouchEnabled device. 'touch' is an InputObject, which contains useful data for querying user input.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "InputBegan": {
                    "summary": "Fired when a user begins interacting via a Human-Computer Interface device (Mouse button down, touch begin, keyboard button down, etc.). 'inputObject' is an InputObject, which contains useful data for querying user input.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "InputChanged": {
                    "summary": "Fired when a user changes interacting via a Human-Computer Interface device (Mouse move, touch move, mouse wheel, etc.). 'inputObject' is an InputObject, which contains useful data for querying user input.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "InputEnded": {
                    "summary": "Fired when a user stops interacting via a Human-Computer Interface device (Mouse button up, touch end, keyboard button up, etc.). 'inputObject' is an InputObject, which contains useful data for querying user input.  This event only fires locally.  This event will always fire regardless of game state."
                },
                "TextBoxFocused": {
                    "summary": "Fired when a user clicks/taps on a textbox to begin text entry. Argument is the textbox that was put in focus. This also fires if a textbox forces focus on the user. This event only fires locally."
                },
                "TextBoxFocusReleased": {
                    "summary": "Fired when a user stops text entry into a textbox (usually by pressing return or clicking/tapping somewhere else on the screen). Argument is the textbox that was taken out of focus. This event only fires locally."
                },
                "DeviceAccelerationChanged": {
                    "summary": "Fired when a user moves a device that has an accelerometer. This is fired with an InputObject, which has type Enum.InputType.Accelerometer, and position that shows the g force in each local device axis. This event only fires locally."
                },
                "DeviceGravityChanged": {
                    "summary": "Fired when the force of gravity changes on a device that has an accelerometer. This is fired with an InputObject, which has type Enum.InputType.Accelerometer, and position that shows the g force in each local device axis. This event only fires locally."
                },
                "DeviceRotationChanged": {
                    "summary": "Fired when a user rotates a device that has an gyroscope. This is fired with an InputObject, which has type Enum.InputType.Gyroscope, and position that shows total rotation in each local device axis.  The delta property describes the amount of rotation that last happened. A second argument of Vector4 is the device's current quaternion rotation in reference to it's default reference frame. This event only fires locally."
                },
                "GetDeviceAcceleration": {
                    "summary": "Returns an InputObject that describes the device's current acceleration. This is fired with an InputObject, which has type Enum.InputType.Accelerometer, and position that shows the g force in each local device axis.  The delta property describes the amount of rotation that last happened. This event only fires locally."
                },
                "GetDeviceGravity": {
                    "summary": "Returns an InputObject that describes the device's current gravity vector. This is fired with an InputObject, which has type Enum.InputType.Accelerometer, and position that shows the g force in each local device axis. The delta property describes the amount of rotation that last happened. This event only fires locally."
                },
                "GetDeviceRotation": {
                    "summary": "Returns an InputObject and a Vector4 that describes the device's current rotation vector. This is fired with an InputObject, which has type Enum.InputType.Gyroscope, and position that shows total rotation in each local device axis. The delta property describes the amount of rotation that last happened. The Vector4 is the device's current quaternion rotation in reference to it's default reference frame. This event only fires locally."
                }
            }
        },
        "Atmosphere": {
            "members": {
                "Density": {
                    "summary": "A value that controls the air particulates density. The proportion of airborne particles per unit of view depth between the camera and the sky."
                },
                "Offset": {
                    "summary": "A value that offsets the quantity of light scattering events among particles in the atmosphere between the camera and the sky."
                },
                "Height": {
                    "summary": "A value that controls the height of fog in the atmosphere above the horizon (not volumetric...yet...)."
                },
                "Color": {
                    "summary": "A Color3 value that changes the hue of the atmosphere, mixed with the sky color."
                },
                "Decay": {
                    "summary": "A Color3 value for the the hue the atmosphere takes on away from the sun towards the horizon, mixed with the sky color (aka extinction)."
                },
                "Haze": {
                    "summary": "A value that controls the haziness of the atmosphere between the camera and the sky (aka turbidity)."
                },
                "Glare": {
                    "summary": "A value that increases the glow of the atmosphere around light the sun."
                }
            }
        },
        "Clouds": {
            "members": {
                "Cover": {
                    "summary": "A value that controls the cloud cover within the clouds volume, from 0 oktas to 8 oktas (full cloud cover)."
                },
                "Density": {
                    "summary": "A value that controls the clouds particulates density. The proportion of airborne water vapour particles within a cubic stud at full cloud cover."
                },
                "Color": {
                    "summary": "A value that controls the cloud's particle material color."
                },
                "Enabled": {
                    "summary": "Toggles Cloud rendering."
                }
            }
        },
        "DepthOfFieldEffect": {
            "summary": "Depth based blur (Depth of Field) effect.",
            "members": {
                "FocusDistance": {
                    "summary": "Controls the distance in stud units away from the camera where are in focus."
                },
                "InFocusRadius": {
                    "summary": "Controls the distance in stud units away from the FocusDistance where both in front and behind objects can begin to blur."
                },
                "NearIntensity": {
                    "summary": "Maximum intensity of the near blur -the higher the Intensity, the stronger the blur is allowed to reach."
                },
                "FarIntensity": {
                    "summary": "Maximum intensity of the far blur -the higher the Intensity, the stronger the blur is allowed to reach."
                }
            }
        },
        "Humanoid": {
            "members": {
                "MoveTo": {
                    "summary": "Attempts to move the Humanoid and it's associated character to 'part'. 'location' is used as an offset from part's origin."
                },
                "TakeDamage": {
                    "summary": "Decreases health by the amount.  Use this instead of changing health directly to make sure weapons are filtered for things such as ForceField(s)."
                },
                "UnequipTools": {
                    "summary": "Takes any active gear/tools that the Humanoid is using and puts them into the backpack.  This function only works on Humanoids with a corresponding Player."
                },
                "EquipTool": {
                    "summary": "Takes a specified tool and equips it to the Humanoid's Character.  Tool argument should be of type 'Tool'."
                },
                "ReplaceBodyPartR15": {
                    "summary": "Replaces the desired bodypart on the Humanoid's Character using a specified Enum.BodyPartR15 and BasePart. Returns a success boolean."
                },
                "GetBodyPartR15": {
                    "summary": "Returns a Enum.BodyPartR15 given a body part in the Humanoid's Character."
                },
                "NameOcclusion": {
                    "summary": "Sets how to display other humanoid names to this humanoid's player. <a href='http://wiki.roblox.com/index.php/NameOcclusion' target='_blank'>More info</a>"
                }
            }
        },
        "PVInstance": {
            "members": {
                "CoordinateFrame": {
                    "summary": "Deprecated. Use CFrame instead"
                },
                "Origin": {
                    "summary": "Positions and rotates the object around its pivot. Call object:PivotTo(...) to move the object in this way via scripts."
                },
                "Origin Orientation": {
                    "summary": "Rotate the object around its pivot. Call object:PivotTo(...) to move the object in this way via scripts."
                },
                "Origin Position": {
                    "summary": "Translate the object by its pivot. Call object:PivotTo(...) to move the object in this way via scripts."
                },
                "Pivot Offset": {
                    "summary": "How the pivot is positioned and oriented relative to the object."
                },
                "Pivot Offset Position": {
                    "summary": "Where the pivot is relative to the object. Set this via scripts using the part.PivotOffset property."
                },
                "Pivot Offset Orientation": {
                    "summary": "How the pivot is oriented relative to the object. Set this via scripts using the part.PivotOffset property."
                }
            }
        },
        "PackageLink": {
            "members": {
                "Status": {
                    "summary": "Current status of the Package"
                }
            }
        },
        "ServiceProvider": {
            "members": {
                "service": {
                    "summary": "Use GetService() instead"
                }
            }
        },
        "Hopper": {
            "summary": "Use StarterPack instead"
        },
        "Instance": {
            "members": {
                "Archivable": {
                    "summary": "Determines whether or not an Instance can be saved when the game closes/attempts to save the game. Note: this only applies to games that use Data Persistence, or SavePlaceAsync."
                },
                "ClassName": {
                    "summary": "The string name of this Instance's most derived class."
                },
                "Parent": {
                    "summary": "The Instance that is directly above this Instance in the tree."
                },
                "GetDebugId": {
                    "summary": "This function is for internal testing. Don't use in production code"
                },
                "Clone": {
                    "summary": "Returns a copy of this Object and all its children. The copy's Parent is nil"
                },
                "clone": {
                    "summary": "Use Clone() instead"
                },
                "isA": {
                    "summary": "Use IsA() instead"
                },
                "IsA": {
                    "summary": "Returns a boolean if this Instance is of type 'className' or a is a subclass of type 'className'.  If 'className' is not a valid class type in ROBLOX, this function will always return false.  <a href='http://wiki.roblox.com/index.php/IsA' target='_blank'>More info</a>"
                },
                "FindFirstChild": {
                    "summary": "Returns the first child of this Instance that matches the first argument 'name'.  The second argument 'recursive' is an optional boolean (defaults to false) that will force the call to traverse down thru all of this Instance's descendants until it finds an object with a name that matches the 'name' argument.  The function will return nil if no Instance is found."
                },
                "FindFirstChildOfClass": {
                    "summary": "Returns the first child of this Instance that with a ClassName equal to 'className'.  The function will return nil if no Instance is found."
                },
                "FindFirstChildWhichIsA": {
                    "summary": "Returns the first child of this Instance that :IsA(className).  The second argument 'recursive' is an optional boolean (defaults to false) that will force the call to traverse down thru all of this Instance's descendants until it finds an object with a name that matches the 'className' argument.  The function will return nil if no Instance is found."
                },
                "FindFirstAncestor": {
                    "summary": "Returns the first ancestor of this Instance that matches the first argument 'name'.  The function will return nil if no Instance is found."
                },
                "FindFirstAncestorOfClass": {
                    "summary": "Returns the first ancestor of this Instance with a ClassName equal to 'className'.  The function will return nil if no Instance is found."
                },
                "FindFirstAncestorWhichIsA": {
                    "summary": "Returns the first ancestor of this Instance that :IsA(className).  The function will return nil if no Instance is found."
                },
                "GetFullName": {
                    "summary": "Returns a string that shows the path from the root node (DataModel) to this Instance.  This string does not include the root node (DataModel)."
                },
                "children": {
                    "summary": "Use GetChildren() instead"
                },
                "getChildren": {
                    "summary": "Use GetChildren() instead"
                },
                "GetChildren": {
                    "summary": "Returns a read-only table of this Object's children"
                },
                "GetDescendants": {
                    "summary": "Returns an array containing all of the descendants of the instance. Returns in preorder traversal, or in other words, where the parents come before their children, depth first."
                },
                "Remove": {
                    "summary": "Deprecated. Use ClearAllChildren() to get rid of all child objects, or Destroy() to invalidate this object and its descendants"
                },
                "remove": {
                    "summary": "Use Remove() instead"
                },
                "ClearAllChildren": {
                    "summary": "Removes all children (but not this object) from the workspace."
                },
                "Destroy": {
                    "summary": "Removes object and all of its children from the workspace. Disconnects object and all children from open connections. Object and children may not be usable after calling Destroy."
                },
                "findFirstChild": {
                    "summary": "Use FindFirstChild() instead"
                },
                "AncestryChanged": {
                    "summary": "Fired when any of this object's ancestors change.  First argument 'child' is the object whose parent changed.  Second argument 'parent' is the first argument's new parent."
                },
                "DescendantAdded": {
                    "summary": "Fired after an Instance is parented to this object, or any of this object's descendants.  The 'descendant' argument is the Instance that is being added."
                },
                "DescendantRemoving": {
                    "summary": "Fired after an Instance is unparented from this object, or any of this object's descendants.  The 'descendant' argument is the Instance that is being added."
                },
                "Changed": {
                    "summary": "Fired after a property changes value.  The property argument is the name of the property"
                }
            }
        },
        "BodyGyro": {
            "summary": "Attempts to maintain a fixed orientation of its parent Part",
            "members": {
                "MaxTorque": {
                    "summary": "The maximum torque that will be exerted on the Part"
                },
                "maxTorque": {
                    "summary": "Use MaxTorque instead"
                },
                "D": {
                    "summary": "The dampening factor applied to this force"
                },
                "P": {
                    "summary": "The power continually applied to this force"
                },
                "CFrame": {
                    "summary": "The cframe that this force is trying to orient its parent Part to.  Note: this force only uses the rotation of the cframe, not the position."
                },
                "cframe": {
                    "summary": "Use CFrame instead"
                }
            }
        },
        "BodyPosition": {
            "members": {
                "MaxForce": {
                    "summary": "The maximum force that will be exerted on the Part"
                },
                "maxForce": {
                    "summary": "Use MaxForce instead"
                },
                "D": {
                    "summary": "The dampening factor applied to this force"
                },
                "P": {
                    "summary": "The power factor continually applied to this force"
                },
                "Position": {
                    "summary": "The Vector3 that this force is trying to position its parent Part to."
                },
                "position": {
                    "summary": "Use position instead"
                }
            }
        },
        "RocketPropulsion": {
            "summary": "A propulsion system that mimics a rocket"
        },
        "BodyVelocity": {
            "members": {
                "MaxForce": {
                    "summary": "The maximum force that will be exerted on the Part in each axis"
                },
                "maxForce": {
                    "summary": "Use MaxForce instead"
                },
                "P": {
                    "summary": "The amount of power we add to the system.  The higher the power, the quicker the force will achieve its goal."
                },
                "Velocity": {
                    "summary": "The velocity this system tries to achieve.  How quickly the system reaches this velocity (if ever) is defined by P."
                },
                "velocity": {
                    "summary": "Use Velocity instead"
                }
            }
        },
        "BodyAngularVelocity": {
            "members": {
                "MaxTorque": {
                    "summary": "The maximum torque that will be exerted on the Part in each axis"
                },
                "maxTorque": {
                    "summary": "Use MaxTorque instead"
                },
                "P": {
                    "summary": "The amount of power we add to the system.  The higher the power, the quicker the force will achieve its goal."
                },
                "AngularVelocity": {
                    "summary": "The rotational velocity this system tries to achieve.  How quickly the system reaches this velocity is defined by P."
                },
                "angularVelocity": {
                    "summary": "Use AngularVelocity instead"
                }
            }
        },
        "BodyForce": {
            "summary": "When parented to a physical part, BodyForce will continually exert a force upon its parent object.",
            "members": {
                "Force": {
                    "summary": "The continual force exerted on an object, defined in each axis."
                },
                "force": {
                    "summary": "Use Force instead"
                }
            }
        },
        "BodyThrust": {
            "members": {
                "Force": {
                    "summary": "The power continually applied to this force"
                },
                "force": {
                    "summary": "Use Force instead"
                },
                "Location": {
                    "summary": "The Vector3 location of where to apply the force to. "
                },
                "location": {
                    "summary": "Use Location instead"
                }
            }
        },
        "Teams": {
            "summary": "This Service-level object is the container for all Team objects in a level. A map that supports team games must have a Teams service. <a href='http://wiki.roblox.com/index.php/Team' target='_blank'>More info</a>",
            "members": {
                "GetPlayers": {
                    "summary": "Returns a read-only table of players which are on this team."
                }
            }
        },
        "Team": {
            "summary": "The Team class is used to represent a faction in a team game. The only valid location for a Team object is under the Teams service. <a href='http://wiki.roblox.com/index.php/Team' target='_blank'>More info</a>"
        },
        "LuaSourceContainer": {
            "members": {
                "CurrentEditor": {
                    "summary": "The name of the player who is currently editing the script in Team Create."
                }
            }
        },
        "Script": {
            "members": {
                "LinkedScript": {
                    "summary": "This property is under development. Do not use"
                }
            }
        },
        "LocalScript": {
            "summary": "A script that runs on clients, NOT servers.  LocalScripts can only run when parented under one of the following:\n        1) A player's Backpack.\n        2) A player's Character model.\n        3) A player's PlayerGui.\n        4) A player's PlayerScripts.\n        5) The ReplicatedFirst service.\n      "
        },
        "PluginCapabilities": {
            "summary": "An instance to be added to a plugin to act as the plugin manifest. Enables configuration of plugin capabilities."
        },
        "RenderingTest": {
            "summary": "dummy summary"
        },
        "Model": {
            "summary": "A construct used to group Parts and other objects together, also allows manipulation of multiple objects.",
            "members": {
                "BreakJoints": {
                    "summary": "Breaks all surface joints contained within"
                },
                "GetModelCFrame": {
                    "summary": "Returns a CFrame that has position of the centroid of all Parts in the Model.  The rotation matrix is either the rotation matrix of the user-defined PrimaryPart, or if not specified then  a part in the Model chosen by the engine."
                },
                "GetModelSize": {
                    "summary": "Returns a Vector3 that is union of the extents of all Parts in the model."
                },
                "MakeJoints": {
                    "summary": "Creates the appropriate SurfaceJoints between all touching Parts contrained within the model. Technically, this function calls MakeJoints() on all Parts inside the model."
                },
                "MoveTo": {
                    "summary": "Moves the centroid of the Model to the specified location, respecting all relative distances between parts in the model."
                },
                "ResetOrientationToIdentity": {
                    "summary": "Rotates all parts in the model to the orientation that was set using SetIdentityOrientation().  If this function has never been called, rotation is reset to GetModelCFrame()'s rotation."
                },
                "SetIdentityOrientation": {
                    "summary": "Takes the current rotation matrix of the model and stores it as the model's identity matrix. The rotation is applied when ResetOrientationToIdentity() is called."
                },
                "TranslateBy": {
                    "summary": "Similar to MoveTo(), except instead of moving to an explicit location, we use the model's current CFrame location and offset it."
                },
                "GetPrimaryPartCFrame": {
                    "summary": "Returns the cframe of the Model.PrimaryPart. If PrimaryPart is nil, then this function will throw an error."
                },
                "SetPrimaryPartCFrame": {
                    "summary": "Sets the cframe of the Model.PrimaryPart. If PrimaryPart is nil, then this function will throw an error. This also sets the cframe of all descendant Parts relative to the cframe change to PrimaryPart."
                },
                "makeJoints": {
                    "summary": "Use MakeJoints() instead"
                },
                "move": {
                    "summary": "Use MoveTo() instead"
                },
                "PrimaryPart": {
                    "summary": "A Part that serves as a reference for the Model's CFrame. Used in conjunction with GetModelPrimaryPartCFrame and SetModelPrimaryPartCFrame. Use this to rotate/translate all Parts relative to the PrimaryPart."
                },
                "LevelOfDetail": {
                    "summary": "Automatically generate impostor meshes to be rendered outside of streaming radius."
                },
                "WorldPivot": {
                    "summary": "How the pivot is positioned and oriented in world space."
                },
                "World Pivot Position": {
                    "summary": "Where the pivot is in world space. Set this via scripts using the model.WorldPivot property."
                },
                "World Pivot Orientation": {
                    "summary": "How the pivot is oriented in world space. Set this via scripts using the model.WorldPivot property."
                }
            }
        },
        "Status": {
            "members": {
                "move": {
                    "summary": "Use MoveTo() instead"
                }
            }
        },
        "DataModel": {
            "summary": "The root of ROBLOX's parent-child hierarchy (commonly known as game after the global variable used to access it)",
            "members": {
                "OnClose": {
                    "summary": "Deprecated. Use DataModel.BindToClose"
                },
                "workspace": {
                    "summary": "Deprecated. Use Workspace"
                },
                "ShowMouse": {
                    "summary": "Deprecated. Use Workspace.IsMouseCursorVisible"
                },
                "IsLoaded": {
                    "summary": "Returns true if the game has finished loading, false otherwise.  Check this before listening to the Loaded signal to ensure a script knows when a game finishes loading."
                },
                "Loaded": {
                    "summary": "Fires when the game finishes loading.  Use this to know when to remove your custom loading gui.  It is best to check IsLoaded() before connecting to this event, as the game may load before the event is connected to."
                },
                "SetPlaceID": {
                    "summary": "Use SetPlaceId() instead"
                },
                "SetCreatorID": {
                    "summary": "Use SetCreatorId() instead"
                }
            }
        },
        "DataStoreService": {
            "summary": "Responsible for storing data across multiple user created places",
            "members": {
                "GetDataStore": {
                    "summary": "Returns a data store with the given name and scope"
                },
                "GetGlobalDataStore": {
                    "summary": "Returns the default data store"
                },
                "GetOrderedDataStore": {
                    "summary": "Returns an ordered data store with the given name and scope"
                }
            }
        },
        "GlobalDataStore": {
            "summary": "Exposes functions for saving and loading data for the DataStoreService",
            "members": {
                "OnUpdate": {
                    "summary": "Sets callback as a function to be executed any time the value associated with key is changed. It is important to disconnect the connection when the subscription to the key is no longer needed. "
                },
                "GetAsync": {
                    "summary": "Returns the value of the entry in the DataStore with the given key"
                },
                "IncrementAsync": {
                    "summary": "Increments the value of a particular key amd returns the incremented value"
                },
                "SetAsync": {
                    "summary": "Sets the value of the key. This overwrites any existing data stored in the key"
                },
                "UpdateAsync": {
                    "summary": "Retrieves the value of the key from the website, and updates it with a new value. The callback until the value fetched matches the value on the web. Returning nil means it will not save. "
                }
            }
        },
        "OrderedDataStore": {
            "summary": "A type of DataStore where values must be positive integers. This makes OrderedDataStore suitable for leaderboard related scripting where you are required to order large amounts of data efficiently.",
            "members": {
                "GetSortedAsync": {
                    "summary": "Returns a DataStorePages object. The length of each page is determined by pageSize, and the order is determined by isAscending. minValue and maxValue are optional parameters which will filter the result. "
                }
            }
        },
        "Camera": {
            "members": {
                "CameraSubject": {
                    "summary": "Where the Camera's focus is.  Any rotation of the camera will be about this subject."
                },
                "CameraType": {
                    "summary": "Defines how the camera will behave. <a href='http://wiki.roblox.com/index.php/CameraType' target='_blank'>More info</a>"
                },
                "CoordinateFrame": {
                    "summary": "The current position and rotation of the Camera.  For most CameraTypes, the rotation is set such that the CoordinateFrame lookVector is pointing at the Focus."
                },
                "CFrame": {
                    "summary": "The current position and rotation of the Camera.  For most CameraTypes, the rotation is set such that the CoordinateFrame lookVector is pointing at the Focus."
                },
                "FieldOfViewMode": {
                    "summary": "Determines how the field of view responds to changes of screen size and aspect ratio."
                },
                "FieldOfView": {
                    "summary": "Describes the view angle along the vertical viewport axis."
                },
                "DiagonalFieldOfView": {
                    "summary": "Describes the view angle along the diagonal viewport axis."
                },
                "MaxAxisFieldOfView": {
                    "summary": "Describes the view angle along the maximum-length viewport axis."
                },
                "Focus": {
                    "summary": "The current CoordinateFrame that the camera is looking at.  Note: it is not always guaranteed that the camera is always looking here."
                },
                "ViewportSize": {
                    "summary": "Holds the x,y screen resolution of the viewport the camera is presenting (note: this can differ from the AbsoluteSize property of a full screen gui)."
                },
                "NearPlaneZ": {
                    "summary": "The negative z-offset of the view frustum's near clipping plane."
                },
                "GetRoll": {
                    "summary": "Returns the camera's current roll. Roll is defined in radians, and is stored as the delta from the camera's y axis default normal vector."
                },
                "WorldToScreenPoint": {
                    "summary": "Takes a 3D position in the world and projects it onto x,y coordinates of screen space. Returns two values, first is a Vector3 that has x,y position and z position which is distance from camera (negative if behind camera, positive if in front). Second return value is a boolean indicating if the first argument is an on-screen coordinate."
                },
                "ScreenPointToRay": {
                    "summary": "Takes a 2D screen position and produces a Ray object to be used for 3D raycasting. Input is x,y screen coordinates, and a (optional, defaults to 0) z position which sets how far in the camera look vector to start the ray origin."
                },
                "ViewportPointToRay": {
                    "summary": "Same as ScreenPointToRay, except no GUI offsets are taken into account. Useful for things like casting a ray from the middle of the Camera.ViewportSize"
                },
                "WorldToViewportPoint": {
                    "summary": "Same as WorldToScreenPoint, except no GUI offsets are taken into account."
                },
                "SetRoll": {
                    "summary": "Sets the camera's current roll. Roll is defined in radians, and is stored as the delta from the camera's y axis default normal vector."
                }
            }
        },
        "Players": {
            "members": {
                "CharacterAutoLoads": {
                    "summary": "Set to true, when a player joins a game, they get a character automatically, as well as when they die.  When set to false, characters do not auto load and will only load in using Player:LoadCharacter()."
                },
                "players": {
                    "summary": "Use GetPlayers() instead"
                }
            }
        },
        "ReplicatedStorage": {
            "summary": "A container whose contents are replicated to all clients and the server."
        },
        "ReplicatedFirst": {
            "summary": "A container whose contents are replicated to all clients (but not back to the server) first before anything else. Useful for creating loading guis, tutorials, etc.",
            "members": {
                "RemoveRobloxLoadingScreen": {
                    "summary": "Removes the default Roblox loading screen from view. Call this when you are ready to either show your own loading gui, or when the game is ready to play."
                }
            }
        },
        "ServerStorage": {
            "summary": "A container whose contents are only on the server."
        },
        "ServerScriptService": {
            "summary": "A container whose contents should be scripts. Scripts that are added to the container are run on the server."
        },
        "StudioService": {
            "summary": "A service for interfacing with the current studio state from Lua."
        },
        "Lighting": {
            "summary": "Responsible for all lighting aspects of the world (affects how things are rendered).",
            "members": {
                "GetMinutesAfterMidnight": {
                    "summary": "The number of minutes that the current time is past midnight.  If currently at midnight, returns 0.  Will return decimal values if not at an exact minute."
                },
                "GetMoonDirection": {
                    "summary": "Returns the lookVector (Vector3) of the moon. If this lookVector was used in a CFrame, the Part would face the moon."
                },
                "GetMoonPhase": {
                    "summary": "Currently always returns 0.75. MoonPhase cannot be edited."
                },
                "GetSunDirection": {
                    "summary": "Returns the lookVector (Vector3) of the sun. If this lookVector was used in a CFrame, the Part would face the sun."
                },
                "SetMinutesAfterMidnight": {
                    "summary": "Sets the time to be a certain number of minutes after midnight.  This works with integer and decimal values."
                },
                "Ambient": {
                    "summary": "The hue of the global lighting.  Changing this changes the color tint of all objects in the Workspace."
                },
                "Brightness": {
                    "summary": "How much global light each Part in the Workspace receives. Standard range is 0 to 2 (0 being little light), but can be increased all the way to 10 (colors start to be appear very different at this value)."
                },
                "EnvironmentDiffuseScale": {
                    "summary": "Sets scale [0-1] of Diffuse Environment Lighting to add to Ambient."
                },
                "EnvironmentSpecularScale": {
                    "summary": "Sets scale [0-1] of Specular Environment Lighting to add to Ambient."
                },
                "ExposureCompensation": {
                    "summary": "Exposure compensation amount. Applies a bias to the exposure level prior to the tonemap step. +1 indicates twice as much exposure and -1 means half as much exposure."
                },
                "ShadowSoftness": {
                    "summary": "This property controls how blurry the shadows are."
                },
                "ColorShift_Bottom": {
                    "summary": "The hue of global lighting on the bottom surfaces of an object."
                },
                "ColorShift_Top": {
                    "summary": "The hue of global lighting on the top surfaces of an object."
                },
                "GeographicLatitude": {
                    "summary": "The latitude position the level is placed at.  This affects sun position. <a href='http://wiki.roblox.com/index.php/GeographicLatitude' target='_blank'>More info</a>"
                },
                "GlobalShadows": {
                    "summary": "Flag enabling shadows from sun and moon in the place"
                },
                "OutdoorAmbient": {
                    "summary": "Effective ambient value for outdoors, effectively shadow color outdoors (requires GlobalShadows enabled)"
                },
                "Outlines": {
                    "summary": "Flag enabling or disabling outlines on parts and terrain"
                },
                "ShadowColor": {
                    "summary": "Color the shadows appear as. Shadows are drawn mostly for characters, but depending on the lighting will also show for Parts in the Workspace.  Rendering settings can also affect if shadows are drawn."
                },
                "TimeOfDay": {
                    "summary": "A string that represent the current time of day. Time is in 24-hour clock format \"XX::YY:ZZ\", where X is hour, Y is minute, and Z is seconds."
                },
                "FogColor": {
                    "summary": "A Color3 value that changes the hue of the atmosphere, mixed with the sky color."
                },
                "FogEnd": {
                    "summary": "The distance at which fog completely blocks your vision. This distance is relative to the camera position. Units are in studs"
                },
                "FogStart": {
                    "summary": "The distance at which the fog gradient begins. This distance is relative to the camera position. Units are in studs."
                },
                "LightingChanged": {
                    "summary": "Fired whenever a property of Lighting is changed, or a skybox or atmosphere is added or removed. Skyboxes are of type 'Sky' these and 'Atmosphere' should be parented directly to lighting."
                }
            }
        },
        "Debris": {
            "summary": "A service that provides utility in cleaning up objects",
            "members": {
                "addItem": {
                    "summary": "Use AddItem() instead"
                },
                "AddItem": {
                    "summary": "Adds an Instance into the debris service that will later be destroyed.  Second argument 'lifetime' is optional and specifies how long (in seconds) to wait before destroying the item. If no time is specified then the item added will automatically be destroyed in 10 seconds."
                },
                "MaxItems": {
                    "summary": "Deprecated. No replacement"
                }
            }
        },
        "Player": {
            "members": {
                "CameraMode": {
                    "summary": "An enum that describes how a Player's camera is allowed to behave. <a href='http://wiki.roblox.com/index.php/CameraMode' target='_blank'>More info</a>."
                },
                "DataReady": {
                    "summary": "Read-only. If true, this Player's persistent data can be loaded, false otherwise. <a href='http://wiki.roblox.com/index.php/ROBLOX_Scripting_How_To:_Data_Persistence' target='_blank'>Info on Data Persistence</a>."
                },
                "LoadCharacter": {
                    "summary": "Loads in a new character for this player.  This will replace the player's current character, if they have one. This should be used in conjunction with Players.CharacterAutoLoads to control spawning of characters. This function only works from a server-side script (NOT a LocalScript)."
                },
                "playerFromCharacter": {
                    "summary": "Use GetPlayerFromCharacter() instead"
                },
                "WaitForDataReady": {
                    "summary": "Yields until the persistent data for this Player is ready to be loaded. <a href='http://wiki.roblox.com/index.php/ROBLOX_Scripting_How_To:_Data_Persistence' target='_blank'>Info on Data Persistence</a>."
                },
                "Idled": {
                    "summary": "Fired periodically after the user has been AFK for a while.  Currently this event is only fired for the *local* Player.  \"time\" is the time in seconds that the user has been idle."
                }
            }
        },
        "Workspace": {
            "members": {
                "InsertPoint": {
                    "summary": "The point the engine attempts to place pasted content at. Set and read this where appropriate in plugins for optimal editing mechanics."
                },
                "FindPartsInRegion3": {
                    "summary": "Returns parts in the area defined by the Region3, up to specified maxCount or 100, whichever is less"
                },
                "FindPartsInRegion3WithIgnoreList": {
                    "summary": "Returns parts in the area defined by the Region3, up to specified maxCount or 100, whichever is less"
                },
                "FindPartOnRay": {
                    "summary": "Deprecated. Use WorldRoot:Raycast() instead"
                },
                "FindPartOnRayWithIgnoreList": {
                    "summary": "Deprecated. Use WorldRoot:Raycast() instead"
                },
                "PGSPhysicsSolverEnabled": {
                    "summary": "Boolean used to enable the new physics solver"
                },
                "FallenPartsDestroyHeight": {
                    "summary": "Sets the height at which falling characters and parts are destroyed. This property is not scriptable and can only be set in Studio"
                },
                "AirDensity": {
                    "summary": "The ground level (y=0) air density in RMU/stud^3, used to calculate the force. The default corresponds to realistic sea-level air density at standard temperature and pressure."
                },
                "FluidForces": {
                    "summary": "Global opt-in/opt-out for the fluid/aero force model."
                }
            }
        },
        "BasePart": {
            "summary": "A structural class, not creatable",
            "members": {
                "Color": {
                    "summary": "Color3 of the part."
                },
                "CFrame": {
                    "summary": "Contains information regarding the Part's position and a matrix that defines the Part's rotation.  Can read/write. <a href='http://wiki.roblox.com/index.php/Cframe' target='_blank'>More info</a>"
                },
                "CanCollide": {
                    "summary": "Determines whether physical interactions with other Parts are respected.  If true, will collide and react with physics to other Parts.  If false, other parts will pass thru instead of colliding"
                },
                "Anchored": {
                    "summary": "Determines whether or not physics acts upon the Part.  If true, part stays 'Anchored' in space, not moving regardless of any collision/forces acting upon it.  If false, physics works normally on the part."
                },
                "Massless": {
                    "summary": "If true the part will be massless when welded to another part that is not massless. The part will still have mass like a normal part if it is an assembly root part according to GetRootPart()."
                },
                "RootPriority": {
                    "summary": "An integer from -127 to 127. Compares before other all other part properties besides massless for deciding which part is the assembly root part according to GetRootPart()."
                },
                "Elasticity": {
                    "summary": "A float value ranging from 0.0f to 1.0f. Sets how much the Part will rebound against another. a value of 1 is like a superball, and 0 is like a lead block."
                },
                "Friction": {
                    "summary": "A float value ranging from 0.0f to 1.0f. Sets how much the Part will be able to slide. a value of 1 is no sliding, and 0 is no friction, so infinite sliding."
                },
                "Locked": {
                    "summary": "Determines whether building tools (in-game and studio) can manipulate this Part.  If true, no editing allowed.  If false, editing is allowed."
                },
                "CastShadow": {
                    "summary": "Determines whether this Part casts a shadow."
                },
                "Material": {
                    "summary": "Specifies the look and feel the Part should have.  Note: this does not define the color the Part is, see BrickColor for that. <a href='http://wiki.roblox.com/index.php/Material' target='_blank'>More info</a>"
                },
                "Reflectance": {
                    "summary": "Specifies how shiny the Part is. A value of 1 is completely reflective (chrome), while a value of 0 is no reflectance (concrete wall)"
                },
                "ResizeIncrement": {
                    "summary": "Sets the value for the smallest change in size allowable by the Resize(NormalId, int) function."
                },
                "ResizeableFaces": {
                    "summary": "Sets the value for the faces allowed to be resized by the Resize(NormalId, int) function."
                },
                "Transparency": {
                    "summary": "Sets how visible an object is. A value of 1 makes the object invisible, while a value of 0 makes the object opaque."
                },
                "Velocity": {
                    "summary": "How fast the Part is traveling in studs/second. This property is NOT recommended to be modified directly, unless there is good reason.  Otherwise, try using a BodyForce to move a Part."
                },
                "Position": {
                    "summary": "Position of the center of the part in world coordinates."
                },
                "Orientation": {
                    "summary": "Rotation around X, Y, and Z axis.  Rotations applied in YXZ order."
                },
                "CenterOfMass": {
                    "summary": "The position of the center of mass of this part."
                },
                "AssemblyMass": {
                    "summary": "The total mass of this part's assembly - collection of parts connected by welds or animated joints."
                },
                "AssemblyCenterOfMass": {
                    "summary": "The position of the center mass of this part's assembly - collection of parts connected by welds or animated joints."
                },
                "AssemblyLinearVelocity": {
                    "summary": "The linear velocity of this part's assembly - collection of parts connected by welds or animated joints."
                },
                "AssemblyAngularVelocity": {
                    "summary": "The angular velocity of this part's rigid body - collection of parts connected by welds or animated joints."
                },
                "AssemblyRootPart": {
                    "summary": "The root part of this part's assembly - can be changed with RootPriority or Anchored property."
                },
                "makeJoints": {
                    "summary": "Use MakeJoints() instead"
                },
                "MakeJoints": {
                    "summary": "Creates the appropriate SurfaceJoints with all parts that are touching this Instance (including internal joints in the Instance, as in a Model).  This uses the SurfaceTypes defined on the surfaces of parts to create the appropriate welds. <a href='http://wiki.roblox.com/index.php/MakeJoints' target='_blank'>More info</a>"
                },
                "BreakJoints": {
                    "summary": "Destroys SurfaceJoints with all parts that are touching this Instance (including internal joints in the Instance, as in a Model)."
                },
                "GetMass": {
                    "summary": "Returns a number that is the mass of this Instance.  Mass of a Part is immutable, and is changed only by the size of the Part."
                },
                "Resize": {
                    "summary": "Resizes a Part in the direction of the face defined by 'NormalId', by the amount specified by 'deltaAmount'. If the operation will expand the part to intersect another Instance, the part will not resize at all.  Return true if the call is successful, false otherwise."
                },
                "getMass": {
                    "summary": "Use GetMass() instead"
                },
                "LocalSimulationTouched": {
                    "summary": "Deprecated. Use Touched instead"
                },
                "StoppedTouching": {
                    "summary": "Deprecated. Use TouchEnded instead"
                },
                "TouchEnded": {
                    "summary": "Fired when the part stops touching another part"
                },
                "EnableFluidForces": {
                    "summary": "When true AND workspace.EnableFluidForces is true, the physics engine includes the aerodynamic forces on the part (and its parent assembly) during the physics timestep."
                }
            }
        },
        "Part": {
            "summary": "A plastic building block - the fundamental component of ROBLOX"
        },
        "TrussPart": {
            "summary": "An extendable building truss"
        },
        "WedgePart": {
            "summary": "A Wedge Part"
        },
        "PrismPart": {
            "summary": "A Prism Part"
        },
        "PyramidPart": {
            "summary": "A Pyramid Part"
        },
        "ParallelRampPart": {
            "summary": "A ParallelRamp Part"
        },
        "RightAngleRampPart": {
            "summary": "A RightAngleRamp Part"
        },
        "CornerWedgePart": {
            "summary": "A CornerWedge Part"
        },
        "PlayerGui": {
            "summary": "A container instance that syncs data between a single player and the server.  ScreenGui objects that are placed in this container will be shown to the Player parent only",
            "members": {
                "SelectionImageObject": {
                    "summary": "Overrides the default selection adornment (used for gamepads). For best results, this should point to a GuiObject."
                }
            }
        },
        "PlayerScripts": {
            "summary": "A container instance that contains LocalScripts.  LocalScript objects that are placed in this container will be execute only when a Player is the parent."
        },
        "StandalonePluginScripts": {
            "summary": "A container instance that contains Scripts.  Useful only for Plugins.  When Studio starts, we load plugins into the 'UserPlugin' data model and execute Scripts contained in StandalonePluginScripts container. If a plugin doesn't have such a container then the plugin isn't loaded into UserPlugin data model.  When a data model for a place is created (e.g. the Edit data model), we load plugins into said data model and execute only those Scripts which are not contained in StandalonePluginScripts container."
        },
        "StarterPlayerScripts": {
            "summary": "A container instance that contains LocalScripts.  LocalScript objects that are placed in this container will be copied to new Players on startup."
        },
        "StarterCharacterScripts": {
            "summary": "A container instance that contains LocalScripts.  LocalScript objects that are placed in this container will be copied to new characters on startup."
        },
        "GuiMain": {
            "summary": "Deprecated, please use ScreenGui"
        },
        "LayerCollector": {
            "summary": "The base class of ScreenGui, BillboardGui, and SurfaceGui.",
            "members": {
                "Enabled": {
                    "summary": "Whether or not this should be displayed."
                },
                "ZIndexBehavior": {
                    "summary": "Controls the behavior of the ZIndex property for descendants of this object. It can be set to Global (Default) or Sibling."
                }
            }
        },
        "ScreenGui": {
            "summary": "The core GUI object on which tools are built.  Add Frames/Labels/Buttons to this object to have them rendered as a 2D overlay"
        },
        "FunctionalTest": {
            "summary": "Deprecated. Use TestService instead"
        },
        "BillboardGui": {
            "summary": "A GUI that adorns an object in the 3D world.  Add Frames/Labels/Buttons to this object to have them rendered while attached to a 3D object",
            "members": {
                "Adornee": {
                    "summary": "The Object the billboard gui uses as its base to render from.  Currently, the only way to set this property is thru a script, and must exist in the workspace.  This will only render if the object assigned derives from BasePart."
                },
                "AbsolutePosition": {
                    "summary": "A read-only Vector2 value that is the GuiObject's current position (x,y) in pixel space, from the top left corner of the GuiObject."
                },
                "AbsoluteSize": {
                    "summary": "A read-only Vector2 value that is the GuiObject's current size (width, height) in pixel space."
                },
                "Active": {
                    "summary": "If true, this GuiObject can fire mouse events and will pass them to any GuiObjects layered underneath, while false will do neither."
                },
                "AlwaysOnTop": {
                    "summary": "If true, billboard gui does not get occluded by 3D objects, but always renders on the screen."
                },
                "Enabled": {
                    "summary": "If true, billboard gui will render, otherwise rendering will be skipped."
                },
                "ExtentsOffset": {
                    "summary": "A Vector3 (x,y,z) defined in studs that will offset the gui from the extents of the 3d object it is rendering from."
                },
                "PlayerToHideFrom": {
                    "summary": "Specifies a Player that the BillboardGui will not render to."
                },
                "StudsOffset": {
                    "summary": "A Vector3 (x,y,z) defined in studs that will offset the gui from the centroid of the 3d object it is rendering from"
                },
                "SizeOffset": {
                    "summary": "A Vector2 (x,y) defined in studs that will offset the gui size from it's current size."
                },
                "Size": {
                    "summary": "A UDim2 value describing the size of the BillboardGui. More information on UDim2 is available <a href='http://wiki.roblox.com/index.php/UDim2' target='_blank'>here</a>. Relative values are defined as one-to-one with studs."
                },
                "LightInfluence": {
                    "summary": "Specifies the amount of influence lighting has on the billboard gui. A value of 0 is unlit, 1 is fully lit. Fractional values blend from unlit to lit."
                }
            }
        },
        "SurfaceGui": {
            "summary": "Renders its contained GuiObjects flat against the face of a part.",
            "members": {
                "Adornee": {
                    "summary": "The Object the surface gui uses as its base to render from.  Currently, the only way to set this property is thru a script, and must exist in the workspace.  This will only render if the object assigned derives from BasePart."
                },
                "Active": {
                    "summary": "If true, this GuiObject can fire mouse events and will pass them to any GuiObjects layered underneath, while false will do neither."
                },
                "Enabled": {
                    "summary": "If true, surface gui will render, otherwise rendering will be skipped."
                },
                "LightInfluence": {
                    "summary": "Specifies the amount of influence lighting has on the surface gui. A value of 0 is unlit, 1 is fully lit. Fractional values blend from unlit to lit."
                },
                "Brightness": {
                    "summary": "Specifies the amount of light this gui emits when LightInfluence is 0."
                }
            }
        },
        "GuiBase2d": {
            "members": {
                "AbsolutePosition": {
                    "summary": "A read-only Vector2 value that is the GuiObject's current position (x,y) in pixel space, from the top left corner of the GuiObject."
                },
                "AbsoluteSize": {
                    "summary": "A read-only Vector2 value that is the GuiObject's current size (width, height) in pixel space."
                }
            }
        },
        "InputObject": {
            "summary": "An object that describes a particular user input, such as mouse movement, touches, keyboard, and more.",
            "members": {
                "UserInputType": {
                    "summary": "An enum that describes what kind of input this object is describing (mousebutton, touch, etc.).  See Enum.UserInputType for more info."
                },
                "UserInputState": {
                    "summary": "An enum that describes what state of a particular input (touch began, touch moved, touch ended, etc.). See Enum.UserInputState for more info."
                },
                "Position": {
                    "summary": "A Vector3 value that describes a positional value of this input. For mouse and touch input, this is the screen position of the mouse/touch, described in the x and y components. For mouse wheel input, the z component describes whether the wheel was moved forward or backward."
                },
                "KeyCode": {
                    "summary": "An enum that describes what kind of input is being pressed. For types of input like Keyboard, this describes what key was pressed. For input like mousebutton, this provides no additional information."
                }
            }
        },
        "GuiObject": {
            "members": {
                "TweenPosition": {
                    "summary": "Smoothly moves a GuiObject from its current position to 'endPosition'. The only required argument is 'endPosition'. <a href='http://wiki.roblox.com/index.php/TweenPosition' target='_blank'>More info</a> "
                },
                "TweenSize": {
                    "summary": "Smoothly translates a GuiObject's current size to 'endSize'. The only required argument is 'endSize'. <a href='http://wiki.roblox.com/index.php/TweenSize' target='_blank'>More info</a> "
                },
                "TweenSizeAndPosition": {
                    "summary": "Smoothly translates a GuiObject's current size to 'endSize', and also smoothly translates the GuiObject's current position to 'endPosition'. The only required arguments are 'endSize' and 'endPosition'. <a href='http://wiki.roblox.com/index.php/TweenSizeAndPosition' target='_blank'>More info</a> "
                },
                "Active": {
                    "summary": "If true, this GuiObject can fire mouse events and will pass them to any GuiObjects layered underneath, while false will do neither."
                },
                "BackgroundColor3": {
                    "summary": "A Color3 value that specifies the background color for the GuiObject. This value is ignored if the Style property (not found on all GuiObjects) is set to something besides custom."
                },
                "BackgroundTransparency": {
                    "summary": "A number value that specifies how transparent the background of the GuiObject is. This value is ignored if the Style property (not found on all GuiObjects) is set to something besides custom."
                },
                "BorderColor3": {
                    "summary": "A Color3 value that specifies the color of the outline of the GuiObject. This value is ignored if the Style property (not found on all GuiObjects) is set to something besides custom."
                },
                "BorderSizePixel": {
                    "summary": "A number value that specifies the thickness (in pixels) of the outline of the GuiObject. Currently this value can only be set to either 0 or 1, any other number has no effect. This value is ignored if the Style property (not found on all GuiObjects) is set to something besides custom."
                },
                "ClipsDescendants": {
                    "summary": "If set to true, any descendants of this GuiObject will only render if contained within it's borders. If set to false, all descendants will render regardless of position."
                },
                "Draggable": {
                    "summary": "If true, allows a GuiObject to be dragged by the user's mouse. The events 'DragBegin' and 'DragStopped' are fired when the appropriate action happens, and only will fire on Draggable=true GuiObjects."
                },
                "Size": {
                    "summary": "A UDim2 value describing the size of the GuiObject on screen in both absolute and relative coordinates. More information on UDim2 is available <a href='http://wiki.roblox.com/index.php/UDim2' target='_blank'>here</a>."
                },
                "Position": {
                    "summary": "A UDim2 value describing the position of the top-left corner of the GuiObject on screen. More information on UDim2 is available <a href='http://wiki.roblox.com/index.php/UDim2' target='_blank'>here</a>."
                },
                "SizeConstraint": {
                    "summary": "The direction(s) that an object can be resized in. <a href='http://wiki.roblox.com/index.php/SizeConstraint' target='_blank'>More info</a>."
                },
                "ZIndex": {
                    "summary": "Describes the ordering in which overlapping GuiObjects will be drawn. A value of 1 is drawn first, while higher values are drawn in ascending order (each value draws over the last)."
                },
                "BackgroundColor": {
                    "summary": "Deprecated. Use BackgroundColor3 instead"
                },
                "BorderColor": {
                    "summary": "Deprecated. Use BorderColor3 instead"
                },
                "SelectionImageObject": {
                    "summary": "Overrides the default selection adornment (used for gamepads). For best results, this should point to a GuiObject."
                },
                "DragBegin": {
                    "summary": "Fired when a GuiObject with Draggable set to true starts to be dragged. 'InitialPosition' is a UDim2 value of the position of the GuiObject before any drag operation began."
                },
                "DragStopped": {
                    "summary": "Always fired after a DragBegin event, DragStopped is fired when the user releases the mouse button causing a drag operation on the GuiObject. Arguments 'x', and 'y' specify the top-left absolute position of the GuiObject when the event is fired."
                },
                "MouseEnter": {
                    "summary": "Fired when the mouse enters a GuiObject, as long as the GuiObject is active (see active property for more detail). Arguments 'x', and 'y' specify the absolute pixel position of the mouse."
                },
                "MouseLeave": {
                    "summary": "Fired when the mouse leaves a GuiObject, as long as the GuiObject is active (see active property for more detail). Arguments 'x', and 'y' specify the absolute pixel position of the mouse."
                },
                "MouseMoved": {
                    "summary": "Fired when the mouse is inside a GuiObject and moves, as long as the GuiObject is active (see active property for more detail). Arguments 'x', and 'y' specify the absolute pixel position of the mouse."
                },
                "TouchTap": {
                    "summary": "Fired when a user taps their finger on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the tap gesture. This event only fires locally.  This event will always fire regardless of game state."
                },
                "TouchPinch": {
                    "summary": "Fired when a user pinches their fingers on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the pinch gesture. 'scale' is a float that indicates the difference from the beginning of the pinch gesture. 'velocity' is a float indicating how quickly the pinch gesture is happening. 'state' indicates the Enum.UserInputState of the gesture.  This event only fires locally."
                },
                "TouchSwipe": {
                    "summary": "Fired when a user swipes their fingers on a TouchEnabled device. 'swipeDirection' is an Enum.SwipeDirection, indicating the direction the user swiped. 'numberOfTouches' is an int that indicates how many touches were involved with the gesture.  This event only fires locally."
                },
                "TouchLongPress": {
                    "summary": "Fired when a user holds at least one finger for a short amount of time on the same screen position on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the gesture. 'state' indicates the Enum.UserInputState of the gesture.  This event only fires locally."
                },
                "TouchRotate": {
                    "summary": "Fired when a user rotates two fingers on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the gesture. 'rotation' is a float indicating how much the rotation has gone from the start of the gesture. 'velocity' is a float that indicates how quickly the gesture is being performed. 'state' indicates the Enum.UserInputState of the gesture.  This event only fires locally."
                },
                "TouchPan": {
                    "summary": "Fired when a user drags at least one finger on a TouchEnabled device. 'touchPositions' is a Lua array of Vector2, each indicating the position of all the fingers involved in the gesture. 'totalTranslation' is a Vector2, indicating how far the pan gesture has gone from its starting point. 'velocity' is a Vector2 that indicates how quickly the gesture is being performed in each dimension. 'state' indicates the Enum.UserInputState of the gesture."
                },
                "InputBegan": {
                    "summary": "Fired when a user begins interacting via a Human-Computer Interface device (Mouse button down, touch begin, keyboard button down, etc.). 'inputObject' is an InputObject, which contains useful data for querying user input.  This event only fires locally."
                },
                "InputChanged": {
                    "summary": "Fired when a user changes interacting via a Human-Computer Interface device (Mouse move, touch move, mouse wheel, etc.). 'inputObject' is an InputObject, which contains useful data for querying user input.  This event only fires locally."
                },
                "InputEnded": {
                    "summary": "Fired when a user stops interacting via a Human-Computer Interface device (Mouse button up, touch end, keyboard button up, etc.). 'inputObject' is an InputObject, which contains useful data for querying user input.  This event only fires locally."
                }
            }
        },
        "Frame": {
            "summary": "A container object used to layout other GUI objects",
            "members": {
                "Style": {
                    "summary": "Determines how a frame will look. Uses Enum.FrameStyle. <a href='http://wiki.roblox.com/index.php?title=API:Enum/FrameStyle' target='_blank'>More info</a>"
                }
            }
        },
        "ScrollingFrame": {
            "members": {
                "ScrollingEnabled": {
                    "summary": "Determines whether or not scrolling is allowed on this frame. If turned off, no scroll bars will be rendered."
                },
                "CanvasSize": {
                    "summary": "Determines the size of the area that is scrollable. The UDim2 is calculated using the parent gui's size, similar to the regular Size property on gui objects."
                },
                "CanvasPosition": {
                    "summary": "The absolute position the scroll frame is in respect to the canvas size. The minimum this can be set to is (0,0), while the max is the absolute canvas size - AbsoluteWindowSize."
                },
                "AbsoluteWindowSize": {
                    "summary": "The size in pixels of the frame, without the scrollbars."
                },
                "AbsoluteCanvasSize": {
                    "summary": "The size in pixels of the scrollable canvas area."
                },
                "ScrollBarThickness": {
                    "summary": "How thick the scroll bar appears. This applies to both the horizontal and vertical scroll bars. Can be set to 0 for no bars render."
                },
                "TopImage": {
                    "summary": "The \"Up\" image on the vertical scrollbar. Size of this is always ScrollBarThickness by ScrollBarThickness. This is also used as the \"left\" image on the horizontal scroll bar."
                },
                "MidImage": {
                    "summary": "The \"Middle\" image on the vertical scrollbar. Size of this can vary in the y direction, but is always set at ScrollBarThickness in x direction. This is also used as the \"mid\" image on the horizontal scroll bar."
                },
                "BottomImage": {
                    "summary": "The \"Down\" image on the vertical scrollbar. Size of this is always ScrollBarThickness by ScrollBarThickness. This is also used as the \"right\" image on the horizontal scroll bar."
                }
            }
        },
        "ImageLabel": {
            "summary": "A GUI object containing an Image",
            "members": {
                "Image": {
                    "summary": "Specifies the id of the texture to display. <a href='http://wiki.roblox.com/index.php?title=API:Class/ImageLabel/Image' target='_blank'>More info</a>"
                },
                "ScaleType": {
                    "summary": "Specifies how an image should be displayed. See ScaleType for more info."
                },
                "SliceCenter": {
                    "summary": "If ScaleType is set to Slice, this Rect is used to specify the central part of the image. Everything outside of this is considered to be the border."
                },
                "TileSize": {
                    "summary": "If ScaleType is set to Tile, this sets the size of the tile."
                }
            }
        },
        "VideoFrame": {
            "summary": "A GUI object containing a video Image"
        },
        "TextLabel": {
            "summary": "A GUI object containing text",
            "members": {
                "TextColor": {
                    "summary": "Deprecated. Use TextColor3 instead"
                },
                "LineHeight": {
                    "summary": "A ratio of TextSize for how far lines should be placed apart."
                },
                "TextSize": {
                    "summary": "The height of a line of text in pixels."
                },
                "TextTransparency": {
                    "summary": "Controls the transparency of the text."
                },
                "TextStrokeTransparency": {
                    "summary": "Controls the transparency of the outline around the text. Multiplied with TextTransparency."
                },
                "ContentText": {
                    "summary": "Raw string without format information that will be displayed."
                }
            }
        },
        "TextButton": {
            "summary": "A GUI button containing text",
            "members": {
                "TextColor": {
                    "summary": "Deprecated. Use TextColor3 instead"
                },
                "LineHeight": {
                    "summary": "A ratio of TextSize for how far lines should be placed apart."
                },
                "TextSize": {
                    "summary": "The height of a line of text in pixels."
                },
                "TextTransparency": {
                    "summary": "Controls the transparency of the text."
                },
                "TextStrokeTransparency": {
                    "summary": "Controls the transparency of the outline around the text. Multiplied with TextTransparency."
                },
                "ContentText": {
                    "summary": "Raw string without format information that will be displayed."
                }
            }
        },
        "TextBox": {
            "summary": "A text entry box",
            "members": {
                "TextColor": {
                    "summary": "Deprecated. Use TextColor3 instead"
                },
                "LineHeight": {
                    "summary": "A ratio of TextSize for how far lines should be placed apart."
                },
                "TextSize": {
                    "summary": "The height of a line of text in pixels."
                },
                "TextTransparency": {
                    "summary": "Controls the transparency of the text."
                },
                "TextStrokeTransparency": {
                    "summary": "Controls the transparency of the outline around the text. Multiplied with TextTransparency."
                },
                "ContentText": {
                    "summary": "Raw string without format information that will be displayed."
                }
            }
        },
        "GuiButton": {
            "summary": "A GUI button containing an Image",
            "members": {
                "AutoButtonColor": {
                    "summary": "Determines whether a button changes color automatically when reacting to mouse events."
                },
                "Modal": {
                    "summary": "Allows the mouse to be free in first person mode. If a button with this property set to true is visible, the mouse is 'free' in first person mode."
                },
                "Style": {
                    "summary": "Determines how a button will look, including mouse event states. Uses Enum.ButtonStyle. <a href='http://wiki.roblox.com/index.php?title=API:Class/GuiButton/Style' target='_blank'>More info</a>"
                },
                "MouseButton1Click": {
                    "summary": "Fired when the mouse is over the button, and the mouse down and up events fire without the mouse leaving the button."
                },
                "MouseButton1Down": {
                    "summary": "Fired when the mouse button is pushed down on a button."
                },
                "MouseButton1Up": {
                    "summary": "Fired when the mouse button is released on a button."
                },
                "MouseButton2Click": {
                    "summary": "This function currently does not work :("
                },
                "MouseButton2Down": {
                    "summary": "This function currently does not work :("
                },
                "MouseButton2Up": {
                    "summary": "This function currently does not work :("
                }
            }
        },
        "ViewportFrame": {
            "summary": "A GUI that can show 3D objects",
            "members": {
                "CurrentCamera": {
                    "summary": "Current Camera of children objects"
                },
                "ImageTransparency": {
                    "summary": "A number value that specifies how transparent the rendered image of the ViewportFrame is"
                },
                "ImageColor3": {
                    "summary": "The rendered image of the ViewportFrame will be multiplied by this color"
                },
                "Ambient": {
                    "summary": "Changing this changes the color tint of all objects in the ViewportFrame."
                },
                "LightColor": {
                    "summary": "Directional light color for objects in the ViewportFrame."
                },
                "LightDirection": {
                    "summary": "Light direction. Value will be normalized. All values valid except (0,0,0)."
                }
            }
        },
        "ImageButton": {
            "summary": "A GUI button containing an Image",
            "members": {
                "Image": {
                    "summary": "Specifies the asset id of the texture to display. <a href='http://wiki.roblox.com/index.php?title=API:Class/ImageButton/Image' target='_blank'>More info</a> "
                },
                "ScaleType": {
                    "summary": "Specifies how an image should be displayed. See ScaleType for more info."
                },
                "SliceCenter": {
                    "summary": "If ScaleType is set to Slice, this Rect is used to specify the central part of the image. Everything outside of this is considered to be the border."
                },
                "TileSize": {
                    "summary": "If ScaleType is set to Tile, this sets the size of the tile."
                }
            }
        },
        "Handles": {
            "summary": "A 3D GUI object to represent draggable handles"
        },
        "ArcHandles": {
            "summary": "A 3D GUI object to represent draggable arc handles"
        },
        "SelectionBox": {
            "summary": "A 3D GUI object to represent the visible selection around an object"
        },
        "SelectionSphere": {
            "summary": "A 3D GUI object to represent the visible selection around an object"
        },
        "SurfaceSelection": {
            "summary": "A 3D GUI object to represent the visible selection around a face of an object"
        },
        "Configuration": {
            "summary": "An object that can be placed under parts to hold Value objects that represent that part's configuration"
        },
        "HumanoidDescription": {
            "summary": "An object that specifies the appearance of Humanoid characters"
        },
        "Folder": {
            "summary": "An object that can be created to hold and organize objects"
        },
        "WorldModel": {
            "summary": "An object that contains a World. Supports rigid joints. Unlike Workspace, WorldModels do not support dynamics simulation."
        },
        "Motor6D": {
            "summary": "The Motor6D object is used to make movable joints between two Parts."
        },
        "BoxHandleAdornment": {
            "summary": "The BoxHandleAdornment is a rectangular prism that can be adorned to a BasePart."
        },
        "ConeHandleAdornment": {
            "summary": "A ConeHandleAdornment is a cone that can be adorned to a BasePart."
        },
        "CylinderHandleAdornment": {
            "summary": "The CylinderHandleAdornment is a cylinder that can be adorned to a BasePart."
        },
        "SphereHandleAdornment": {
            "summary": "The SphereHandleAdornment is a sphere that can be adorned to a BasePart."
        },
        "LineHandleAdornment": {
            "summary": "The LineHandleAdornment is a line that can be adorned to a BasePart."
        },
        "ImageHandleAdornment": {
            "summary": "The ImageHandleAdornment is an image that can be adorned to a BasePart."
        },
        "SelectionPartLasso": {
            "summary": "A visual line drawn representation between two part objects"
        },
        "SelectionPointLasso": {
            "summary": "A visual line drawn representation between two positions"
        },
        "PartPairLasso": {
            "summary": "A visual line drawn representation between two parts."
        },
        "PoseBase": {
            "summary": "The base class to all Pose Objects."
        },
        "Pose": {
            "summary": "The pose of a joint relative to its parent part in a keyframe"
        },
        "NumberPose": {
            "summary": "The value of a float channel for a specific keyframe"
        },
        "KeyframeMarker": {
            "summary": "Represents when an event should be fired in an animation"
        },
        "Keyframe": {
            "summary": "One keyframe of an animation"
        },
        "Animation": {
            "summary": "Represents a linked animation object, containing keyframes and poses."
        },
        "AnimationTrack": {
            "summary": "Returned by a call to LoadAnimation. Controls the playback of an animation on a Humanoid."
        },
        "AnimationController": {
            "summary": "Allows animations to be played on joints of the parent object."
        },
        "CharacterMesh": {
            "summary": "Modifies the appearance of a body part."
        },
        "Dialog": {
            "summary": "An object used to make dialog trees to converse with players",
            "members": {
                "ConversationDistance": {
                    "summary": "The maximum distance that the player's character can be from the dialog's parent in order to use the dialog."
                },
                "GoodbyeChoiceActive": {
                    "summary": "Indicates whether or not an extra choice is available for the player to exit the dialog tree at this node."
                },
                "GoodbyeDialog": {
                    "summary": "The prompt text for an extra choice that allows the player to exit the dialog tree at this node."
                },
                "InUse": {
                    "summary": "Indicates whether or not the dialog is currently being used by one or more players."
                },
                "InitialPrompt": {
                    "summary": "The chat message that is displayed to the player when they first activate the dialog."
                },
                "Purpose": {
                    "summary": "Describes the purpose of the dialog, which is used to display a relevant icon on the dialog's activation button."
                },
                "Tone": {
                    "summary": "Describes the tone of the dialog, which is used to display a relevant color in the dialog interface."
                },
                "BehaviorType": {
                    "summary": "Indicates how the dialog may be used by players. Use Enum.DialogBehaviorType.SinglePlayer if only one player should interact with the dialog at a time, otherwise use Enum.DialogBehaviorType.MultiplePlayers."
                },
                "GetCurrentPlayers": {
                    "summary": "Returns an array of the players currently conversing with this dialog."
                }
            }
        },
        "DialogChoice": {
            "summary": "An object used to make dialog trees to converse with players"
        },
        "UnionOperation": {
            "summary": "A UnionOperation is a union of multiple parts",
            "members": {
                "UsePartColor": {
                    "summary": "Override the colors of the mesh with the part color."
                }
            }
        },
        "NegateOperation": {
            "summary": "A NegateOperation can be used to create holes in other parts",
            "members": {
                "UsePartColor": {
                    "summary": "Override the colors of the mesh with the part color."
                }
            }
        },
        "MeshPart": {
            "summary": "A MeshPart is a physically simulatable mesh"
        },
        "Terrain": {
            "summary": "Object representing a high performance bounded grid of static 4x4 parts",
            "members": {
                "Decoration": {
                    "summary": "Enables terrain materials decoration"
                },
                "GetCell": {
                    "summary": "Returns CellMaterial, CellBlock, CellOrientation"
                },
                "GetWaterCell": {
                    "summary": "Returns hasAnyWater, WaterForce, WaterDirection"
                }
            }
        },
        "Light": {
            "summary": "Parent of all light objects"
        },
        "PointLight": {
            "summary": "Makes the parent part emit light in a spherical shape"
        },
        "SpotLight": {
            "summary": "Makes the parent part emit light in a conical shape"
        },
        "SurfaceLight": {
            "summary": "Makes the parent part emit light in a frustum shape from rectangle defined by part"
        },
        "RemoteFunction": {
            "summary": "Allow functions defined in one script to be called by another script across client/server boundary"
        },
        "RemoteEvent": {
            "summary": "Allow events defined in one script to be subscribed to by another script across client/server boundary"
        },
        "UnreliableRemoteEvent": {
            "summary": "Allow events defined in one script to be subscribed to by another script across client/server boundary. Sent unreliably and unordered."
        },
        "TerrainRegion": {
            "summary": "Object representing a snapshot of the region of terrain"
        },
        "ModuleScript": {
            "summary": "A script fragment. Only runs when another script uses require() on it."
        }
    },
    "enums": {
        "ContextActionResult": {
            "items": {
                "Sink": {
                    "summary": "If 'functionToBind' from ContextActionService:BindAction() returns Enum.ContextActionResult.Sink, the input event will stop at that function and no other bound actions under it will be invoked. This is the default behavior if 'functionToBind' does not return anything or yields in any way."
                },
                "Pass": {
                    "summary": "If 'functionToBind' from ContextActionService:BindAction() returns Enum.ContextActionResult.Pass, the input event is considered to have not been handled by 'functionToBind' and will continue being passed to actions bound to the same input type."
                }
            }
        },
        "SortOrder": {
            "summary": "The ordering to use for sorting an array of GuiObjects.",
            "items": {
                "Name": {
                    "summary": "Sort by alphabetical ordering of the Name property."
                },
                "LayoutOrder": {
                    "summary": "Sort using the less than operator on the LayoutOrder property of GuiObject."
                }
            }
        },
        "ZIndexBehavior": {
            "summary": "Controls the behavior of the ZIndex property.",
            "items": {
                "Global": {
                    "summary": "The ZIndex property will override the default value computed from the depth in the hierarchy."
                },
                "Sibling": {
                    "summary": "The ZIndex property will control the order that the GuiObject will be rendered relative to its siblings."
                }
            }
        },
        "ScaleType": {
            "summary": "Controls how an image is displayed.",
            "items": {
                "Stretch": {
                    "summary": "Force the image to fill the available space."
                },
                "Slice": {
                    "summary": "Use the SliceCenter property to stretch the middle of the image but maintain crisp borders."
                },
                "Tile": {
                    "summary": "Tile the image using the TileSize property."
                },
                "Fit": {
                    "summary": "Size the image to the largest size that will fit in the available space while maintaining aspect ratio."
                },
                "Crop": {
                    "summary": "Fill the available space, maintaining aspect ratio by cropping the edges if necessary."
                }
            }
        }
    }
}
